apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32_fdcan.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* References:
 *   SAMV7D3 Series Data Sheet
 *   Atmel sample code
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/semaphore.h>
#include <nuttx/can/can.h>

#include "arm_internal.h"
#include "arm_arch.h"

#include "stm32_fdcan.h"
#include "hardware/stm32_pinmap.h"
#include "stm32_gpio.h"
#include "stm32_rcc.h"

#if defined(CONFIG_CAN) && defined(CONFIG_STM32H7_FDCAN)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Common definitions *******************************************************/

#ifndef MIN
#  define MIN(a,b) ((a < b) ? a : b)
#endif

#ifndef MAX
#  define MAX(a,b) ((a > b) ? a : b)
#endif

/* Clock source *************************************************************/

/* PCK5 is the programmable clock source, common to all FDCAN controllers */

// #if defined(CONFIG_STM32H7_FDCAN_CLKSRC_SLOW)
// #  define STM32H7_FDCAN_CLKSRC           PMC_PCK_CSS_SLOW
// #  define STM32H7_FDCAN_CLKSRC_FREQUENCY BOARD_SLOWCLK_FREQUENCY
// #elif defined(CONFIG_STM32H7_FDCAN_CLKSRC_PLLA)
// #  define STM32H7_FDCAN_CLKSRC           PMC_PCK_CSS_PLLA
// #  define STM32H7_FDCAN_CLKSRC_FREQUENCY BOARD_PLLA_FREQUENCY
// #elif defined(CONFIG_STM32H7_FDCAN_CLKSRC_UPLL)
// #  define STM32H7_FDCAN_CLKSRC           PMC_PCK_CSS_UPLL
// #  define STM32H7_FDCAN_CLKSRC_FREQUENCY BOARD_UPLL_FREQUENCY
// #elif defined(CONFIG_STM32H7_FDCAN_CLKSRC_MCK)
// #  define STM32H7_FDCAN_CLKSRC           PMC_PCK_CSS_MCK
// #  define STM32H7_FDCAN_CLKSRC_FREQUENCY BOARD_MCK_FREQUENCY
// #else /* if defined(CONFIG_STM32H7_FDCAN_CLKSRC_MAIN */
// #  define STM32H7_FDCAN_CLKSRC           PMC_PCK_CSS_MAIN
// #  define STM32H7_FDCAN_CLKSRC_FREQUENCY BOARD_MAINOSC_FREQUENCY
// #endif

// #ifndef CONFIG_STM32H7_FDCAN_CLKSRC_PRESCALER
// #  define CONFIG_STM32H7_FDCAN_CLKSRC_PRESCALER 1
// #endif

// #define STM32H7_FDCANCLK_FREQUENCY \
//   (STM32H7_FDCAN_CLKSRC_FREQUENCY / CONFIG_STM32H7_FDCAN_CLKSRC_PRESCALER)

#define STM32H7_FDCANCLK_FREQUENCY STM32_FDCANCLK
/* Buffer Alignment *********************************************************/

/* Buffer Alignment.
 *
 * The FDCAN peripheral does not require any data be aligned.  However, if
 * the data cache is enabled then alignment is required.  That is because
 * the data will need to be invalidated and that cache invalidation will
 * occur in multiples of full change lines.
 */

// #ifdef CONFIG_ARMV7M_DCACHE
// #  define FDCAN_ALIGN        ARMV7M_DCACHE_LINESIZE
// #  define FDCAN_ALIGN_MASK   (FDCAN_ALIGN-1)
// #  define FDCAN_ALIGN_UP(n)  (((n) + FDCAN_ALIGN_MASK) & ~FDCAN_ALIGN_MASK)

// #  ifndef CONFIG_ARMV7M_DCACHE_WRITETHROUGH
// #    warning !!! This driver will not work without CONFIG_ARMV7M_DCACHE_WRITETHROUGH=y!!!
// #  endif
// #endif

/* General Configuration ****************************************************/

#ifndef CONFIG_CAN_TXREADY
#  warning WARNING!!! CONFIG_CAN_TXREADY is required by this driver
#endif

/* FDCAN1 Configuration ******************************************************/

#ifdef CONFIG_STM32H7_FDCAN1

/* Bit timing */

#  define FDCAN1_NTSEG1  (CONFIG_STM32H7_FDCAN1_NTSEG1 - 1)
#  define FDCAN1_NTSEG2  (CONFIG_STM32H7_FDCAN1_NTSEG2 - 1)
#  define FDCAN1_NBRP    ((uint32_t)(((float) STM32H7_FDCANCLK_FREQUENCY / \
                       ((float)(FDCAN1_NTSEG1 + FDCAN1_NTSEG2 + 3) * \
                        (float)CONFIG_STM32H7_FDCAN1_BITRATE)) - 1))
#  define FDCAN1_NSJW    (CONFIG_STM32H7_FDCAN1_NSJW - 1)

#  if FDCAN1_NTSEG1 > 63
#    error Invalid FDCAN1 NTSEG1
#  endif
#  if FDCAN1_NTSEG2 > 15
#    error Invalid FDCAN1 NTSEG2
#  endif
#  if FDCAN1_NSJW > 15
#    error Invalid FDCAN1 NSJW
#  endif

#  define FDCAN1_DTSEG1 (CONFIG_STM32H7_FDCAN1_FPROPSEG + CONFIG_STM32H7_FDCAN1_FPHASESEG1)
#  define FDCAN1_DTSEG2 (CONFIG_STM32H7_FDCAN1_FPHASESEG2)
#  define FDCAN1_DBRP   ((uint32_t)(((float) STM32H7_FDCANCLK_FREQUENCY / \
                       ((float)(FDCAN1_DTSEG1 + FDCAN1_DTSEG2 + 3) * \
                        (float)CONFIG_STM32H7_FDCAN1_FBITRATE)) - 1))
#  define FDCAN1_DSJW   (CONFIG_STM32H7_FDCAN1_FFSJW - 1)

#  if FDCAN1_DTSEG1 > 15
#    error Invalid FDCAN1 DTSEG1
#  endif
#  if FDCAN1_DTSEG2 > 7
#    error Invalid FDCAN1 DTSEG2
#  endif
#  if FDCAN1_DSJW > 3
#    error Invalid FDCAN1 DSJW
#  endif

/* FDCAN1 Message RAM Configuration ******************************************************/

/* FDCAN1 standard filters */

#  ifndef CONFIG_STM32H7_FDCAN1_NSTDFILTERS
#    define CONFIG_STM32H7_FDCAN1_NSTDFILTERS 0
#  endif

#  if (CONFIG_STM32H7_FDCAN1_NSTDFILTERS > 128)
#    error Invalid FDCAN1 number of Standard Filters
#  endif

#  define FDCAN1_STDFILTER_BYTES \
      (CONFIG_STM32H7_FDCAN1_NSTDFILTERS << 2)
      // FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN1_NSTDFILTERS << 2)
#  define FDCAN1_STDFILTER_WORDS (FDCAN1_STDFILTER_BYTES >> 2)


/* FDCAN1 extended filters */

#  ifndef CONFIG_STM32H7_FDCAN1_NEXTFILTERS
#    define CONFIG_STM32H7_FDCAN1_NEXTFILTERS 0
#  endif

#  if (CONFIG_STM32H7_FDCAN1_NEXTFILTERS > 64)
#    error Invalid FDCAN1 number of Extended Filters
#  endif

#  define FDCAN1_EXTFILTER_BYTES \
      (CONFIG_STM32H7_FDCAN1_NEXTFILTERS << 3)
      // FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN1_NEXTFILTERS << 3)
#  define FDCAN1_EXTFILTER_WORDS (FDCAN1_EXTFILTER_BYTES >> 2)


/* FDCAN1 RX FIFO0 */

