apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
#  ifndef CONFIG_STM32H7_FDCAN1_RXFIFO0_SIZE
#    define CONFIG_STM32H7_FDCAN1_RXFIFO0_SIZE 0
#  endif

#  if CONFIG_STM32H7_FDCAN1_RXFIFO0_SIZE > 64
#    error Invalid FDCAN1 number of RX FIFO0 elements
#  endif

#  if defined(CONFIG_STM32H7_FDCAN1_RXFIFO0_8BYTES)
#    define FDCAN1_RXFIFO0_ELEMENT_SIZE  8
#    define FDCAN1_RXFIFO0_ENCODED_SIZE  0
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO0_12BYTES)
#    define FDCAN1_RXFIFO0_ELEMENT_SIZE  12
#    define FDCAN1_RXFIFO0_ENCODED_SIZE  1
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO0_16BYTES)
#    define FDCAN1_RXFIFO0_ELEMENT_SIZE  16
#    define FDCAN1_RXFIFO0_ENCODED_SIZE  2
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO0_20BYTES)
#    define FDCAN1_RXFIFO0_ELEMENT_SIZE  20
#    define FDCAN1_RXFIFO0_ENCODED_SIZE  3
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO0_24BYTES)
#    define FDCAN1_RXFIFO0_ELEMENT_SIZE  24
#    define FDCAN1_RXFIFO0_ENCODED_SIZE  4
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO0_32BYTES)
#    define FDCAN1_RXFIFO0_ELEMENT_SIZE  32
#    define FDCAN1_RXFIFO0_ENCODED_SIZE  5
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO0_48BYTES)
#    define FDCAN1_RXFIFO0_ELEMENT_SIZE  48
#    define FDCAN1_RXFIFO0_ENCODED_SIZE  6
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO0_64BYTES)
#    define FDCAN1_RXFIFO0_ELEMENT_SIZE  64
#    define FDCAN1_RXFIFO0_ENCODED_SIZE  7
#  else
#    define FDCAN1_RXFIFO0_ELEMENT_SIZE  8
#    define FDCAN1_RXFIFO0_ENCODED_SIZE  0
#  endif

#  define FDCAN1_RXFIFO0_BYTES \
     (CONFIG_STM32H7_FDCAN1_RXFIFO0_SIZE * \
                  (FDCAN1_RXFIFO0_ELEMENT_SIZE + 8))
     // FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN1_RXFIFO0_SIZE * \
     //               FDCAN1_RXFIFO0_ELEMENT_SIZE + 8)
#  define FDCAN1_RXFIFO0_WORDS (FDCAN1_RXFIFO0_BYTES >> 2)


/* FDCAN1 RX FIFO1 */

#  ifndef CONFIG_STM32H7_FDCAN1_RXFIFO1_SIZE
#    define CONFIG_STM32H7_FDCAN1_RXFIFO1_SIZE 0
#  endif

#  if CONFIG_STM32H7_FDCAN1_RXFIFO1_SIZE > 64
#    error Invalid FDCAN1 number of RX FIFO1 elements
#  endif

#  if defined(CONFIG_STM32H7_FDCAN1_RXFIFO1_8BYTES)
#    define FDCAN1_RXFIFO1_ELEMENT_SIZE  8
#    define FDCAN1_RXFIFO1_ENCODED_SIZE  0
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO1_12BYTES)
#    define FDCAN1_RXFIFO1_ELEMENT_SIZE  12
#    define FDCAN1_RXFIFO1_ENCODED_SIZE  1
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO1_16BYTES)
#    define FDCAN1_RXFIFO1_ELEMENT_SIZE  16
#    define FDCAN1_RXFIFO1_ENCODED_SIZE  2
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO1_20BYTES)
#    define FDCAN1_RXFIFO1_ELEMENT_SIZE  20
#    define FDCAN1_RXFIFO1_ENCODED_SIZE  3
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO1_24BYTES)
#    define FDCAN1_RXFIFO1_ELEMENT_SIZE  24
#    define FDCAN1_RXFIFO1_ENCODED_SIZE  4
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO1_32BYTES)
#    define FDCAN1_RXFIFO1_ELEMENT_SIZE  32
#    define FDCAN1_RXFIFO1_ENCODED_SIZE  5
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO1_48BYTES)
#    define FDCAN1_RXFIFO1_ELEMENT_SIZE  48
#    define FDCAN1_RXFIFO1_ENCODED_SIZE  6
#  elif defined(CONFIG_STM32H7_FDCAN1_RXFIFO1_64BYTES)
#    define FDCAN1_RXFIFO1_ELEMENT_SIZE  64
#    define FDCAN1_RXFIFO1_ENCODED_SIZE  7
#  else
#    define FDCAN1_RXFIFO1_ELEMENT_SIZE  8
#    define FDCAN1_RXFIFO1_ENCODED_SIZE  0
#  endif

// #  define FDCAN1_RXFIFO1_BYTES \
//      FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN1_RXFIFO1_SIZE * \
//                    FDCAN1_RXFIFO1_ELEMENT_SIZE + 8)
#  define FDCAN1_RXFIFO1_BYTES (CONFIG_STM32H7_FDCAN1_RXFIFO1_SIZE * \
                   (FDCAN1_RXFIFO1_ELEMENT_SIZE + 8))
#  define FDCAN1_RXFIFO1_WORDS (FDCAN1_RXFIFO1_BYTES >> 2)


/* FDCAN1 RX dedicated buffer */

#  ifndef CONFIG_STM32H7_FDCAN1_DEDICATED_RXBUFFER_SIZE
#    define CONFIG_STM32H7_FDCAN1_DEDICATED_RXBUFFER_SIZE 0
#  endif

#  if CONFIG_STM32H7_FDCAN1_DEDICATED_RXBUFFER_SIZE > 64
#    error Invalid FDCAN1 number of RX BUFFER elements
#  endif

#  if defined(CONFIG_STM32H7_FDCAN1_RXBUFFER_8BYTES)
#    define FDCAN1_RXBUFFER_ELEMENT_SIZE  8
#    define FDCAN1_RXBUFFER_ENCODED_SIZE  0
#  elif defined(CONFIG_STM32H7_FDCAN1_RXBUFFER_12BYTES)
#    define FDCAN1_RXBUFFER_ELEMENT_SIZE  12
#    define FDCAN1_RXBUFFER_ENCODED_SIZE  1
#  elif defined(CONFIG_STM32H7_FDCAN1_RXBUFFER_16BYTES)
#    define FDCAN1_RXBUFFER_ELEMENT_SIZE  16
#    define FDCAN1_RXBUFFER_ENCODED_SIZE  2
#  elif defined(CONFIG_STM32H7_FDCAN1_RXBUFFER_20BYTES)
#    define FDCAN1_RXBUFFER_ELEMENT_SIZE  20
#    define FDCAN1_RXBUFFER_ENCODED_SIZE  3
#  elif defined(CONFIG_STM32H7_FDCAN1_RXBUFFER_24BYTES)
#    define FDCAN1_RXBUFFER_ELEMENT_SIZE  24
#    define FDCAN1_RXBUFFER_ENCODED_SIZE  4
#  elif defined(CONFIG_STM32H7_FDCAN1_RXBUFFER_32BYTES)
#    define FDCAN1_RXBUFFER_ELEMENT_SIZE  32
#    define FDCAN1_RXBUFFER_ENCODED_SIZE  5
#  elif defined(CONFIG_STM32H7_FDCAN1_RXBUFFER_48BYTES)
#    define FDCAN1_RXBUFFER_ELEMENT_SIZE  48
#    define FDCAN1_RXBUFFER_ENCODED_SIZE  6
#  elif defined(CONFIG_STM32H7_FDCAN1_RXBUFFER_64BYTES)
#    define FDCAN1_RXBUFFER_ELEMENT_SIZE  64
#    define FDCAN1_RXBUFFER_ENCODED_SIZE  7
#  else
#    define FDCAN1_RXBUFFER_ELEMENT_SIZE  8
#    define FDCAN1_RXBUFFER_ENCODED_SIZE  0
#  endif

#  define FDCAN1_DEDICATED_RXBUFFER_BYTES \
     (CONFIG_STM32H7_FDCAN1_DEDICATED_RXBUFFER_SIZE * \
                   (FDCAN1_RXBUFFER_ELEMENT_SIZE + 8))
     // FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN1_DEDICATED_RXBUFFER_SIZE * \
                   FDCAN1_RXBUFFER_ELEMENT_SIZE + 8)
#  define FDCAN1_DEDICATED_RXBUFFER_WORDS \
     (FDCAN1_DEDICATED_RXBUFFER_BYTES >> 2)


/* FDCAN1 TX buffer element size */

#  if defined(CONFIG_STM32H7_FDCAN1_TXBUFFER_8BYTES)
#    define FDCAN1_TXBUFFER_ELEMENT_SIZE  8
#    define FDCAN1_TXBUFFER_ENCODED_SIZE  0
#  elif defined(CONFIG_STM32H7_FDCAN1_TXBUFFER_12BYTES)
#    define FDCAN1_TXBUFFER_ELEMENT_SIZE  12
#    define FDCAN1_TXBUFFER_ENCODED_SIZE  1
#  elif defined(CONFIG_STM32H7_FDCAN1_TXBUFFER_16BYTES)
#    define FDCAN1_TXBUFFER_ELEMENT_SIZE  16
#    define FDCAN1_TXBUFFER_ENCODED_SIZE  2
#  elif defined(CONFIG_STM32H7_FDCAN1_TXBUFFER_20BYTES)
#    define FDCAN1_TXBUFFER_ELEMENT_SIZE  20
#    define FDCAN1_TXBUFFER_ENCODED_SIZE  3
#  elif defined(CONFIG_STM32H7_FDCAN1_TXBUFFER_24BYTES)
#    define FDCAN1_TXBUFFER_ELEMENT_SIZE  24
#    define FDCAN1_TXBUFFER_ENCODED_SIZE  4
#  elif defined(CONFIG_STM32H7_FDCAN1_TXBUFFER_32BYTES)
#    define FDCAN1_TXBUFFER_ELEMENT_SIZE  32
#    define FDCAN1_TXBUFFER_ENCODED_SIZE  5
#  elif defined(CONFIG_STM32H7_FDCAN1_TXBUFFER_48BYTES)
#    define FDCAN1_TXBUFFER_ELEMENT_SIZE  48
#    define FDCAN1_TXBUFFER_ENCODED_SIZE  6
#  elif defined(CONFIG_STM32H7_FDCAN1_TXBUFFER_64BYTES)
#    define FDCAN1_TXBUFFER_ELEMENT_SIZE  64
#    define FDCAN1_TXBUFFER_ENCODED_SIZE  7
#  else
#    define FDCAN1_TXBUFFER_ELEMENT_SIZE  8
#    define FDCAN1_TXBUFFER_ENCODED_SIZE  0
#  endif


/* FDCAN1 TX dedicated buffer */

#  ifndef CONFIG_STM32H7_FDCAN1_DEDICATED_TXBUFFER_SIZE
#    define CONFIG_STM32H7_FDCAN1_DEDICATED_TXBUFFER_SIZE 0
#  endif

#  define FDCAN1_DEDICATED_TXBUFFER_BYTES \
     (CONFIG_STM32H7_FDCAN1_DEDICATED_TXBUFFER_SIZE * \
                   (FDCAN1_TXBUFFER_ELEMENT_SIZE + 8))
     // FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN1_DEDICATED_TXBUFFER_SIZE * \
     //               FDCAN1_TXBUFFER_ELEMENT_SIZE + 8)
#  define FDCAN1_DEDICATED_TXBUFFER_WORDS \
     (FDCAN1_DEDICATED_TXBUFFER_BYTES >> 2)


