apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
/* FDCAN1 TX FIFO/Queue*/

#  ifndef CONFIG_STM32H7_FDCAN1_TXFIFOQ_SIZE
#    define CONFIG_STM32H7_FDCAN1_TXFIFOQ_SIZE 0
#  endif

#  if (CONFIG_STM32H7_FDCAN1_DEDICATED_TXBUFFER_SIZE + \
       CONFIG_STM32H7_FDCAN1_TXFIFOQ_SIZE) > 32
#    error Invalid FDCAN1 number of TX BUFFER elements
#  endif

#  define FDCAN1_TXFIFIOQ_BYTES \
     (CONFIG_STM32H7_FDCAN1_TXFIFOQ_SIZE *  \
                   (FDCAN1_TXBUFFER_ELEMENT_SIZE + 8))
     // FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN1_TXFIFOQ_SIZE *  \
                   FDCAN1_TXBUFFER_ELEMENT_SIZE + 8)
#  define FDCAN1_TXFIFIOQ_WORDS (FDCAN1_TXFIFIOQ_BYTES >> 2)


/* FDCAN1 TX Event FIFO */

#  ifndef CONFIG_STM32H7_FDCAN1_TXEVENTFIFO_SIZE
#    define CONFIG_STM32H7_FDCAN1_TXEVENTFIFO_SIZE 0
#  endif

#  if CONFIG_STM32H7_FDCAN1_TXEVENTFIFO_SIZE > 32
#    error Invalid FDCAN1 number of TX EVENT FIFO elements
#  endif

#  define FDCAN1_TXEVENTFIFO_BYTES \
     (CONFIG_STM32H7_FDCAN1_TXEVENTFIFO_SIZE << 3)
     // FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN1_TXEVENTFIFO_SIZE << 3)
#  define FDCAN1_TXEVENTFIFO_WORDS \
     (FDCAN1_TXEVENTFIFO_BYTES >> 2)


/* FDCAN1 Message RAM Layout*/

#  define FDCAN1_STDFILTER_INDEX   0
#  define FDCAN1_EXTFILTERS_INDEX  (FDCAN1_STDFILTER_INDEX + FDCAN1_STDFILTER_WORDS)
#  define FDCAN1_RXFIFO0_INDEX     (FDCAN1_EXTFILTERS_INDEX + FDCAN1_EXTFILTER_WORDS)
#  define FDCAN1_RXFIFO1_INDEX     (FDCAN1_RXFIFO0_INDEX + FDCAN1_RXFIFO0_WORDS)
#  define FDCAN1_RXDEDICATED_INDEX (FDCAN1_RXFIFO1_INDEX + FDCAN1_RXFIFO1_WORDS)
#  define FDCAN1_TXEVENTFIFO_INDEX (FDCAN1_RXDEDICATED_INDEX + FDCAN1_DEDICATED_RXBUFFER_WORDS)
#  define FDCAN1_TXDEDICATED_INDEX (FDCAN1_TXEVENTFIFO_INDEX + FDCAN1_TXEVENTFIFO_WORDS)
#  define FDCAN1_TXFIFOQ_INDEX     (FDCAN1_TXDEDICATED_INDEX + FDCAN1_DEDICATED_TXBUFFER_WORDS)
#  define FDCAN1_MSGRAM_WORDS      (FDCAN1_TXFIFOQ_INDEX + FDCAN1_TXFIFIOQ_WORDS)

#endif /* CONFIG_STM32H7_FDCAN1 */

/* Loopback mode */

#undef STM32H7_FDCAN_LOOPBACK
#if defined(CONFIG_STM32H7_FDCAN1_LOOPBACK) || defined(CONFIG_STM32H7_FDCAN2_LOOPBACK)
#  define STM32H7_FDCAN_LOOPBACK 1
#endif

/* FDCAN2 Configuration ******************************************************/

#ifdef CONFIG_STM32H7_FDCAN2
  /* Bit timing */

#  define FDCAN2_NTSEG1  CONFIG_STM32H7_FDCAN2_NTSEG1
#  define FDCAN2_NTSEG2  CONFIG_STM32H7_FDCAN2_NTSEG2
#  define FDCAN2_NBRP    ((uint32_t)(((float) STM32H7_FDCANCLK_FREQUENCY / \
                       ((float)(FDCAN2_NTSEG1 + FDCAN2_NTSEG2 + 3) * \
                        (float)CONFIG_STM32H7_FDCAN2_BITRATE)) - 1))
#  define FDCAN2_NSJW    (CONFIG_STM32H7_FDCAN2_NSJW - 1)

#  if FDCAN2_NTSEG1 > 63
#    error Invalid FDCAN2 NTSEG1
#  endif
#  if FDCAN2_NTSEG2 > 15
#    error Invalid FDCAN2 NTSEG2
#  endif
#  if FDCAN2_NSJW > 15
#    error Invalid FDCAN2 NSJW
#  endif

#  define FDCAN2_DTSEG1 (CONFIG_STM32H7_FDCAN2_FPROPSEG + CONFIG_STM32H7_FDCAN2_FPHASESEG1)
#  define FDCAN2_DTSEG2 (CONFIG_STM32H7_FDCAN2_FPHASESEG2)
#  define FDCAN2_DBRP   ((uint32_t)(((float) STM32H7_FDCANCLK_FREQUENCY / \
                       ((float)(FDCAN2_DTSEG1 + FDCAN2_DTSEG2 + 3) * \
                        (float)CONFIG_STM32H7_FDCAN2_FBITRATE)) - 1))
#  define FDCAN2_DSJW   (CONFIG_STM32H7_FDCAN2_FFSJW - 1)

#if FDCAN2_DTSEG1 > 15
#  error Invalid FDCAN2 DTSEG1
#endif
#if FDCAN2_DTSEG2 > 7
#  error Invalid FDCAN2 DTSEG2
#endif
#if FDCAN2_DSJW > 3
#  error Invalid FDCAN2 DSJW
#endif

/* FDCAN2 RX FIFO0 element size */

#  if defined(CONFIG_STM32H7_FDCAN2_RXFIFO0_8BYTES)
#    define FDCAN2_RXFIFO0_ELEMENT_SIZE  8
#    define FDCAN2_RXFIFO0_ENCODED_SIZE  0
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO0_12BYTES)
#    define FDCAN2_RXFIFO0_ELEMENT_SIZE  12
#    define FDCAN2_RXFIFO0_ENCODED_SIZE  1
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO0_16BYTES)
#    define FDCAN2_RXFIFO0_ELEMENT_SIZE  16
#    define FDCAN2_RXFIFO0_ENCODED_SIZE  2
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO0_20BYTES)
#    define FDCAN2_RXFIFO0_ELEMENT_SIZE  20
#    define FDCAN2_RXFIFO0_ENCODED_SIZE  3
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO0_24BYTES)
#    define FDCAN2_RXFIFO0_ELEMENT_SIZE  24
#    define FDCAN2_RXFIFO0_ENCODED_SIZE  4
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO0_32BYTES)
#    define FDCAN2_RXFIFO0_ELEMENT_SIZE  32
#    define FDCAN2_RXFIFO0_ENCODED_SIZE  5
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO0_48BYTES)
#    define FDCAN2_RXFIFO0_ELEMENT_SIZE  48
#    define FDCAN2_RXFIFO0_ENCODED_SIZE  6
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO0_64BYTES)
#    define FDCAN2_RXFIFO0_ELEMENT_SIZE  64
#    define FDCAN2_RXFIFO0_ENCODED_SIZE  7
#  else
#    error Undefined FDCAN2 RX FIFO0 element size
#  endif

#  ifndef CONFIG_STM32H7_FDCAN2_RXFIFO0_SIZE
#    define CONFIG_STM32H7_FDCAN2_RXFIFO0_SIZE 0
#  endif

#  if CONFIG_STM32H7_FDCAN2_RXFIFO0_SIZE > 64
#    error Invalid FDCAN2 number of RX FIFO 0 elements
#  endif

#  define FDCAN2_RXFIFO0_BYTES \
     FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN2_RXFIFO0_SIZE * \
                   FDCAN2_RXFIFO0_ELEMENT_SIZE + 8)
#  define FDCAN2_RXFIFO0_WORDS (FDCAN2_RXFIFO0_BYTES >> 2)

/* FDCAN2 RX FIFO1 element size */

#  if defined(CONFIG_STM32H7_FDCAN2_RXFIFO1_8BYTES)
#    define FDCAN2_RXFIFO1_ELEMENT_SIZE  8
#    define FDCAN2_RXFIFO1_ENCODED_SIZE  0
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO1_12BYTES)
#    define FDCAN2_RXFIFO1_ELEMENT_SIZE  12
#    define FDCAN2_RXFIFO1_ENCODED_SIZE  1
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO1_16BYTES)
#    define FDCAN2_RXFIFO1_ELEMENT_SIZE  16
#    define FDCAN2_RXFIFO1_ENCODED_SIZE  2
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO1_20BYTES)
#    define FDCAN2_RXFIFO1_ELEMENT_SIZE  20
#    define FDCAN2_RXFIFO1_ENCODED_SIZE  3
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO1_24BYTES)
#    define FDCAN2_RXFIFO1_ELEMENT_SIZE  24
#    define FDCAN2_RXFIFO1_ENCODED_SIZE  4
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO1_32BYTES)
#    define FDCAN2_RXFIFO1_ELEMENT_SIZE  32
#    define FDCAN2_RXFIFO1_ENCODED_SIZE  5
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO1_48BYTES)
#    define FDCAN2_RXFIFO1_ELEMENT_SIZE  48
#    define FDCAN2_RXFIFO1_ENCODED_SIZE  6
#  elif defined(CONFIG_STM32H7_FDCAN2_RXFIFO1_64BYTES)
#    define FDCAN2_RXFIFO1_ELEMENT_SIZE  64
#    define FDCAN2_RXFIFO1_ENCODED_SIZE  7
#  else
#    error Undefined FDCAN2 RX FIFO1 element size
#  endif

#  ifndef CONFIG_STM32H7_FDCAN2_RXFIFO1_SIZE
#    define CONFIG_STM32H7_FDCAN2_RXFIFO1_SIZE 0
#  endif

#  if CONFIG_STM32H7_FDCAN2_RXFIFO1_SIZE > 64
#    error Invalid FDCAN2 number of RX FIFO 0 elements
#  endif

#  define FDCAN2_RXFIFO1_BYTES \
     FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN2_RXFIFO1_SIZE * \
                   FDCAN2_RXFIFO1_ELEMENT_SIZE + 8)
#  define FDCAN2_RXFIFO1_WORDS (FDCAN2_RXFIFO1_BYTES >> 2)

/* FDCAN2 Filters */

#  ifndef CONFIG_STM32H7_FDCAN2_NSTDFILTERS
#    define CONFIG_STM32H7_FDCAN2_NSTDFILTERS 0
#  endif

#  if CONFIG_STM32H7_FDCAN2_NSTDFILTERS > 128
#    error Invalid FDCAN2 number of Standard Filters
#  endif

#  ifndef CONFIG_STM32H7_FDCAN2_NEXTFILTERS
#    define CONFIG_STM32H7_FDCAN2_NEXTFILTERS 0
#  endif

#  if CONFIG_STM32H7_FDCAN2_NEXTFILTERS > 64
#    error Invalid FDCAN2 number of Extended Filters
#  endif

