apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
#  define FDCAN2_STDFILTER_BYTES \
      FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN2_NSTDFILTERS << 2)
#  define FDCAN2_STDFILTER_WORDS (FDCAN2_STDFILTER_BYTES >> 2)

#  define FDCAN2_EXTFILTER_BYTES \
      FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN2_NEXTFILTERS << 3)
#  define FDCAN2_EXTFILTER_WORDS (FDCAN2_EXTFILTER_BYTES >> 2)

/* FDCAN2 RX buffer element size */

#  if defined(CONFIG_STM32H7_FDCAN2_RXBUFFER_8BYTES)
#    define FDCAN2_RXBUFFER_ELEMENT_SIZE  8
#    define FDCAN2_RXBUFFER_ENCODED_SIZE  0
#  elif defined(CONFIG_STM32H7_FDCAN2_RXBUFFER_12BYTES)
#    define FDCAN2_RXBUFFER_ELEMENT_SIZE  12
#    define FDCAN2_RXBUFFER_ENCODED_SIZE  1
#  elif defined(CONFIG_STM32H7_FDCAN2_RXBUFFER_16BYTES)
#    define FDCAN2_RXBUFFER_ELEMENT_SIZE  16
#    define FDCAN2_RXBUFFER_ENCODED_SIZE  2
#  elif defined(CONFIG_STM32H7_FDCAN2_RXBUFFER_20BYTES)
#    define FDCAN2_RXBUFFER_ELEMENT_SIZE  20
#    define FDCAN2_RXBUFFER_ENCODED_SIZE  3
#  elif defined(CONFIG_STM32H7_FDCAN2_RXBUFFER_24BYTES)
#    define FDCAN2_RXBUFFER_ELEMENT_SIZE  24
#    define FDCAN2_RXBUFFER_ENCODED_SIZE  4
#  elif defined(CONFIG_STM32H7_FDCAN2_RXBUFFER_32BYTES)
#    define FDCAN2_RXBUFFER_ELEMENT_SIZE  32
#    define FDCAN2_RXBUFFER_ENCODED_SIZE  5
#  elif defined(CONFIG_STM32H7_FDCAN2_RXBUFFER_48BYTES)
#    define FDCAN2_RXBUFFER_ELEMENT_SIZE  48
#    define FDCAN2_RXBUFFER_ENCODED_SIZE  6
#  elif defined(CONFIG_STM32H7_FDCAN2_RXBUFFER_64BYTES)
#    define FDCAN2_RXBUFFER_ELEMENT_SIZE  64
#    define FDCAN2_RXBUFFER_ENCODED_SIZE  7
#  else
#    error Undefined FDCAN2 RX buffer element size
#  endif

#  ifndef CONFIG_STM32H7_FDCAN2_DEDICATED_RXBUFFER_SIZE
#    define CONFIG_STM32H7_FDCAN2_DEDICATED_RXBUFFER_SIZE 0
#  endif

#  if CONFIG_STM32H7_FDCAN2_DEDICATED_RXBUFFER_SIZE > 64
#    error Invalid FDCAN2 number of RX BUFFER elements
#  endif

#  define FDCAN2_DEDICATED_RXBUFFER_BYTES \
     FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN2_DEDICATED_RXBUFFER_SIZE * \
                   FDCAN2_RXBUFFER_ELEMENT_SIZE + 8)
#  define FDCAN2_DEDICATED_RXBUFFER_WORDS \
     (FDCAN2_DEDICATED_RXBUFFER_BYTES >> 2)

/* FDCAN2 TX buffer element size */

#  if defined(CONFIG_STM32H7_FDCAN2_TXBUFFER_8BYTES)
#    define FDCAN2_TXBUFFER_ELEMENT_SIZE  8
#    define FDCAN2_TXBUFFER_ENCODED_SIZE  0
#  elif defined(CONFIG_STM32H7_FDCAN2_TXBUFFER_12BYTES)
#    define FDCAN2_TXBUFFER_ELEMENT_SIZE  12
#    define FDCAN2_TXBUFFER_ENCODED_SIZE  1
#  elif defined(CONFIG_STM32H7_FDCAN2_TXBUFFER_16BYTES)
#    define FDCAN2_TXBUFFER_ELEMENT_SIZE  16
#    define FDCAN2_TXBUFFER_ENCODED_SIZE  2
#  elif defined(CONFIG_STM32H7_FDCAN2_TXBUFFER_20BYTES)
#    define FDCAN2_TXBUFFER_ELEMENT_SIZE  20
#    define FDCAN2_TXBUFFER_ENCODED_SIZE  3
#  elif defined(CONFIG_STM32H7_FDCAN2_TXBUFFER_24BYTES)
#    define FDCAN2_TXBUFFER_ELEMENT_SIZE  24
#    define FDCAN2_TXBUFFER_ENCODED_SIZE  4
#  elif defined(CONFIG_STM32H7_FDCAN2_TXBUFFER_32BYTES)
#    define FDCAN2_TXBUFFER_ELEMENT_SIZE  32
#    define FDCAN2_TXBUFFER_ENCODED_SIZE  5
#  elif defined(CONFIG_STM32H7_FDCAN2_TXBUFFER_48BYTES)
#    define FDCAN2_TXBUFFER_ELEMENT_SIZE  48
#    define FDCAN2_TXBUFFER_ENCODED_SIZE  6
#  elif defined(CONFIG_STM32H7_FDCAN2_TXBUFFER_64BYTES)
#    define FDCAN2_TXBUFFER_ELEMENT_SIZE  64
#    define FDCAN2_TXBUFFER_ENCODED_SIZE  7
#  else
#    error Undefined FDCAN2 TX buffer element size
#  endif

#  ifndef CONFIG_STM32H7_FDCAN2_DEDICATED_TXBUFFER_SIZE
#    define CONFIG_STM32H7_FDCAN2_DEDICATED_TXBUFFER_SIZE 0
#  endif

#  define FDCAN2_DEDICATED_TXBUFFER_BYTES \
     FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN2_DEDICATED_TXBUFFER_SIZE * \
                   FDCAN2_TXBUFFER_ELEMENT_SIZE + 8)
#  define FDCAN2_DEDICATED_TXBUFFER_WORDS \
     (FDCAN2_DEDICATED_TXBUFFER_BYTES >> 2)

/* FDCAN2 TX FIFOs */

#  ifndef CONFIG_STM32H7_FDCAN2_TXFIFOQ_SIZE
#    define CONFIG_STM32H7_FDCAN2_TXFIFOQ_SIZE 0
#  endif

#  if (CONFIG_STM32H7_FDCAN2_DEDICATED_TXBUFFER_SIZE + \
       CONFIG_STM32H7_FDCAN2_TXFIFOQ_SIZE) > 32
#    error Invalid FDCAN2 number of TX BUFFER elements
#  endif

#  ifndef CONFIG_STM32H7_FDCAN2_TXEVENTFIFO_SIZE
#    define CONFIG_STM32H7_FDCAN2_TXEVENTFIFO_SIZE 0
#  endif

#  if CONFIG_STM32H7_FDCAN2_TXEVENTFIFO_SIZE > 32
#    error Invalid FDCAN2 number of TX EVENT FIFO elements
#  endif

#  define FDCAN2_TXEVENTFIFO_BYTES \
     FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN2_TXEVENTFIFO_SIZE << 3)
#  define FDCAN2_TXEVENTFIFO_WORDS \
     (FDCAN2_TXEVENTFIFO_BYTES >> 2)

#  define FDCAN2_TXFIFIOQ_BYTES \
     FDCAN_ALIGN_UP(CONFIG_STM32H7_FDCAN2_TXFIFOQ_SIZE *  \
                   FDCAN2_TXBUFFER_ELEMENT_SIZE + 8)
#  define FDCAN2_TXFIFIOQ_WORDS (FDCAN2_TXFIFIOQ_BYTES >> 2)

/* FDCAN2 Message RAM */

#  define FDCAN2_STDFILTER_INDEX   0
#  define FDCAN2_EXTFILTERS_INDEX  (FDCAN2_STDFILTER_INDEX + FDCAN2_STDFILTER_WORDS)
#  define FDCAN2_RXFIFO0_INDEX     (FDCAN2_EXTFILTERS_INDEX + FDCAN2_EXTFILTER_WORDS)
#  define FDCAN2_RXFIFO1_INDEX     (FDCAN2_RXFIFO0_INDEX + FDCAN2_RXFIFO0_WORDS)
#  define FDCAN2_RXDEDICATED_INDEX (FDCAN2_RXFIFO1_INDEX + FDCAN2_RXFIFO1_WORDS)
#  define FDCAN2_TXEVENTFIFO_INDEX (FDCAN2_RXDEDICATED_INDEX + FDCAN2_DEDICATED_RXBUFFER_WORDS)
#  define FDCAN2_TXDEDICATED_INDEX (FDCAN2_TXEVENTFIFO_INDEX + FDCAN2_TXEVENTFIFO_WORDS)
#  define FDCAN2_TXFIFOQ_INDEX     (FDCAN2_TXDEDICATED_INDEX + FDCAN2_DEDICATED_TXBUFFER_WORDS)
#  define FDCAN2_MSGRAM_WORDS      (FDCAN2_TXFIFOQ_INDEX + FDCAN2_TXFIFIOQ_WORDS)

#endif /* CONFIG_STM32H7_FDCAN2 */

/* Interrupts ***************************************************************/

/* Common interrupts
 *
 *   FDCAN_INT_TSW  - Timestamp Wraparound
 *   FDCAN_INT_MRAF - Message RAM Access Failure
 *   FDCAN_INT_TOO  - Timeout Occurred
 *   FDCAN_INT_ELO  - Error Logging Overflow
 *   FDCAN_INT_EP   - Error Passive
 *   FDCAN_INT_EW   - Warning Status
 *   FDCAN_INT_BO   - Bus_Off Status
 *   FDCAN_INT_WDI  - Watchdog Interrupt
 *   FDCAN_INT_PEA  - Protocol Error in Arbritration Phase
 *   FDCAN_INT_PED  - Protocol Error in Data Phase
 */

#define FDCAN_CMNERR_INTS   (FDCAN_INT_MRAF | FDCAN_INT_TOO | FDCAN_INT_EP | \
                            FDCAN_INT_BO | FDCAN_INT_WDI | FDCAN_INT_PEA | \
                            FDCAN_INT_PED)
#define FDCAN_COMMON_INTS   FDCAN_CMNERR_INTS

/* RXFIFO mode interrupts
 *
 *   FDCAN_INT_RF0N - Receive FIFO 0 New Message
 *   FDCAN_INT_RF0W - Receive FIFO 0 Watermark Reached
 *   FDCAN_INT_RF0F - Receive FIFO 0 Full
 *   FDCAN_INT_RF0L - Receive FIFO 0 Message Lost
 *   FDCAN_INT_RF1N - Receive FIFO 1 New Message
 *   FDCAN_INT_RF1W - Receive FIFO 1 Watermark Reached
 *   FDCAN_INT_RF1F - Receive FIFO 1 Full
 *   FDCAN_INT_RF1L - Receive FIFO 1 Message Lost
 *   FDCAN_INT_HPM  - High Priority Message Received
 *
 * Dedicated RX Buffer mode interrupts
 *
 *   FDCAN_INT_DRX  - Message stored to Dedicated Receive Buffer
 */

#define FDCAN_RXCOMMON_INTS  0
#define FDCAN_RXFIFO0_INTS  (FDCAN_INT_RF0N | FDCAN_INT_RF0W | FDCAN_INT_RF0L)
#define FDCAN_RXFIFO1_INTS  (FDCAN_INT_RF1N | FDCAN_INT_RF1W | FDCAN_INT_RF1L)
#define FDCAN_RXFIFO_INTS   (FDCAN_RXFIFO0_INTS | FDCAN_RXFIFO1_INTS | \
                            FDCAN_INT_HPM | FDCAN_RXCOMMON_INTS)
#define FDCAN_RXDEDBUF_INTS (FDCAN_INT_DRX | FDCAN_RXCOMMON_INTS)

