apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
#ifdef CONFIG_STM32H7_FDCAN_REGDEBUG
  uintptr_t regaddr;        /* Last register address read */
  uint32_t regval;          /* Last value read from the register */
  unsigned int count;       /* Number of times that the value was read */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* FDCAN Register access */

static uint32_t fdcan_getreg(FAR struct stm32_fdcan_s *priv, int offset);
static void fdcan_putreg(FAR struct stm32_fdcan_s *priv, int offset,
              uint32_t regval);
#ifdef CONFIG_STM32H7_FDCAN_REGDEBUG
static void fdcan_dumpregs(FAR struct stm32_fdcan_s *priv, FAR const char *msg);
static void fdcan_dumprxregs(FAR struct stm32_fdcan_s *priv, FAR const char *msg);
static void fdcan_dumptxregs(FAR struct stm32_fdcan_s *priv, FAR const char *msg);
static void fdcan_dumpramlayout(FAR struct stm32_fdcan_s *priv);
#else
#  define fdcan_dumpregs(priv,msg)
#  define fdcan_dumprxregs(priv,msg)
#  define fdcan_dumptxregs(priv,msg)
#  define fdcan_dumpramlayout(priv)
#endif

/* Semaphore helpers */

static int fdcan_dev_lock(FAR struct stm32_fdcan_s *priv);
static int fdcan_dev_lock_noncancelable(FAR struct stm32_fdcan_s *priv);
#define fdcan_dev_unlock(priv) nxsem_post(&priv->locksem)

static void fdcan_buffer_reserve(FAR struct stm32_fdcan_s *priv);
static void fdcan_buffer_release(FAR struct stm32_fdcan_s *priv);

/* FDCAN helpers */

static uint8_t fdcan_dlc2bytes(FAR struct stm32_fdcan_s *priv, uint8_t dlc);
#if 0 /* Not used */
static uint8_t fdcan_bytes2dlc(FAR struct stm32_fdcan_s *priv, uint8_t nbytes);
#endif

#ifdef CONFIG_CAN_EXTID
static int fdcan_add_extfilter(FAR struct stm32_fdcan_s *priv,
              FAR struct canioc_extfilter_s *extconfig);
static int fdcan_del_extfilter(FAR struct stm32_fdcan_s *priv, int ndx);
#endif
static int fdcan_add_stdfilter(FAR struct stm32_fdcan_s *priv,
              FAR struct canioc_stdfilter_s *stdconfig);
static int fdcan_del_stdfilter(FAR struct stm32_fdcan_s *priv, int ndx);

/* CAN driver methods */

static void fdcan_reset(FAR struct can_dev_s *dev);
static int  fdcan_setup(FAR struct can_dev_s *dev);
static void fdcan_shutdown(FAR struct can_dev_s *dev);
static void fdcan_rxint(FAR struct can_dev_s *dev, bool enable);
static void fdcan_txint(FAR struct can_dev_s *dev, bool enable);
static int  fdcan_ioctl(FAR struct can_dev_s *dev, int cmd,
              unsigned long arg);
static int  fdcan_remoterequest(FAR struct can_dev_s *dev, uint16_t id);
static int  fdcan_send(FAR struct can_dev_s *dev, FAR struct can_msg_s *msg);
static bool fdcan_txready(FAR struct can_dev_s *dev);
static bool fdcan_txempty(FAR struct can_dev_s *dev);

/* FDCAN interrupt handling */

#if 0 /* Not Used */
static bool fdcan_dedicated_rxbuffer_available(FAR struct stm32_fdcan_s *priv,
              int bufndx);
#endif
#ifdef CONFIG_CAN_ERRORS
static void fdcan_error(FAR struct can_dev_s *dev, uint32_t status);
#endif
static void fdcan_receive(FAR struct can_dev_s *dev,
              FAR uint32_t *rxbuffer, unsigned long nwords);
static int  fdcan_interrupt(int irq, void *context, FAR void *arg);

/* Hardware initialization */

static int  fdcan_hw_initialize(FAR struct stm32_fdcan_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct can_ops_s g_fdcanops =
{
  .co_reset         = fdcan_reset,
  .co_setup         = fdcan_setup,
  .co_shutdown      = fdcan_shutdown,
  .co_rxint         = fdcan_rxint,
  .co_txint         = fdcan_txint,
  .co_ioctl         = fdcan_ioctl,
  .co_remoterequest = fdcan_remoterequest,
  .co_send          = fdcan_send,
  .co_txready       = fdcan_txready,
  .co_txempty       = fdcan_txempty,
};

#ifdef CONFIG_STM32H7_FDCAN1
/* Message RAM allocation */

// static uint32_t g_fdcan1_msgram[FDCAN1_MSGRAM_WORDS]
// #ifdef CONFIG_ARMV7M_DCACHE
//   __attribute__((aligned(FDCAN_ALIGN)));
// #else
//   ;
// #endif

/* Constant configuration */

static const struct stm32_config_s g_fdcan1const =
{
  .rxpinset         = GPIO_FDCAN1_RX,
  .txpinset         = GPIO_FDCAN1_TX,
  .base             = STM32_FDCAN1_BASE,
  .baud             = CONFIG_STM32H7_FDCAN1_BITRATE,
  .nbtp             = FDCAN_NBTP_NBRP(FDCAN1_NBRP) |
                      FDCAN_NBTP_NTSEG1(FDCAN1_NTSEG1) |
                      FDCAN_NBTP_NTSEG2(FDCAN1_NTSEG2) |
                      FDCAN_NBTP_NSJW(FDCAN1_NSJW),
  .dbtp             = FDCAN_DBTP_DBRP(FDCAN1_DBRP) |
                      FDCAN_DBTP_DTSEG1(FDCAN1_DTSEG1) |
                      FDCAN_DBTP_DTSEG2(FDCAN1_DTSEG2) |
                      FDCAN_DBTP_DSJW(FDCAN1_DSJW),
  .port             = 1,
  .irq0             = STM32_IRQ_FDCAN1_0,
  .irq1             = STM32_IRQ_FDCAN1_1,
#if defined(CONFIG_STM32H7_FDCAN1_CLASSIC)
  .mode             = FDCAN_CLASSIC_MODE,
#elif defined(CONFIG_STM32H7_FDCAN1_FD)
  .mode             = FDCAN_FD_MODE,
#else /* if defined(STM32H7_FDCAN1_ISO11898_1) */
  .mode             = FDCAN_FD_BRS_MODE,
#endif
#if defined(CONFIG_STM32H7_FDCAN1_NONISO_FORMAT)
  .format           = FDCAN_NONISO_BOSCH_V1_FORMAT,
#else
  .format           = FDCAN_ISO11898_1_FORMAT,
#endif
  .nstdfilters      = CONFIG_STM32H7_FDCAN1_NSTDFILTERS,
  .nextfilters      = CONFIG_STM32H7_FDCAN1_NEXTFILTERS,
  .nrxfifo0         = CONFIG_STM32H7_FDCAN1_RXFIFO0_SIZE,
  .nrxfifo1         = CONFIG_STM32H7_FDCAN1_RXFIFO1_SIZE,
  .nrxdedicated     = CONFIG_STM32H7_FDCAN1_DEDICATED_RXBUFFER_SIZE,
  .ntxeventfifo     = CONFIG_STM32H7_FDCAN1_TXEVENTFIFO_SIZE,
  .ntxdedicated     = CONFIG_STM32H7_FDCAN1_DEDICATED_TXBUFFER_SIZE,
  .ntxfifoq         = CONFIG_STM32H7_FDCAN1_TXFIFOQ_SIZE,
  .stdfiltersstart  = FDCAN1_STDFILTER_INDEX,
  .extfiltersstart  = FDCAN1_EXTFILTERS_INDEX,
  .rxfifo0start     = FDCAN1_RXFIFO0_INDEX,
  .rxfifo1start     = FDCAN1_RXFIFO1_INDEX,
  .rxbufferstart    = FDCAN1_RXDEDICATED_INDEX,
  .txeventstart     = FDCAN1_TXEVENTFIFO_INDEX,
  .txbufferstart    = FDCAN1_TXDEDICATED_INDEX,
  .txfifoqstart     = FDCAN1_TXFIFOQ_INDEX,
  .rxfifo0ecode     = FDCAN1_RXFIFO0_ENCODED_SIZE,
  .rxfifo0esize     = (FDCAN1_RXFIFO0_ELEMENT_SIZE / 4) + 2,
  .rxfifo1ecode     = FDCAN1_RXFIFO1_ENCODED_SIZE,
  .rxfifo1esize     = (FDCAN1_RXFIFO1_ELEMENT_SIZE / 4) + 2,
  .rxbufferecode    = FDCAN1_RXBUFFER_ENCODED_SIZE,
  .rxbufferesize    = (FDCAN1_RXBUFFER_ELEMENT_SIZE / 4) + 2,
  .txbufferecode    = FDCAN1_TXBUFFER_ENCODED_SIZE,
  .txbufferesize    = (FDCAN1_TXBUFFER_ELEMENT_SIZE / 4) + 2,

#ifdef CONFIG_STM32H7_FDCAN1_LOOPBACK
  .loopback         = true,
#endif

