apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
  /* FDCAN1 Message RAM */

  .msgram =
  {
    (uint32_t*)(STM32_CANRAM_BASE),
    (uint32_t*)(STM32_CANRAM_BASE + (FDCAN1_EXTFILTERS_INDEX << 2)),
    (uint32_t*)(STM32_CANRAM_BASE + (FDCAN1_RXFIFO0_INDEX << 2)),
    (uint32_t*)(STM32_CANRAM_BASE + (FDCAN1_RXFIFO1_INDEX << 2)),
    (uint32_t*)(STM32_CANRAM_BASE + (FDCAN1_RXDEDICATED_INDEX << 2)),
    (uint32_t*)(STM32_CANRAM_BASE + (FDCAN1_TXEVENTFIFO_INDEX << 2)),
    (uint32_t*)(STM32_CANRAM_BASE + (FDCAN1_TXDEDICATED_INDEX << 2)),
    (uint32_t*)(STM32_CANRAM_BASE + (FDCAN1_TXFIFOQ_INDEX << 2))
  }

  // .msgram =
  // {
  //    &g_fdcan1_msgram[FDCAN1_STDFILTER_INDEX],
  //    &g_fdcan1_msgram[FDCAN1_EXTFILTERS_INDEX],
  //    &g_fdcan1_msgram[FDCAN1_RXFIFO0_INDEX],
  //    &g_fdcan1_msgram[FDCAN1_RXFIFO1_INDEX],
  //    &g_fdcan1_msgram[FDCAN1_RXDEDICATED_INDEX],
  //    &g_fdcan1_msgram[FDCAN1_TXEVENTFIFO_INDEX],
  //    &g_fdcan1_msgram[FDCAN1_TXDEDICATED_INDEX],
  //    &g_fdcan1_msgram[FDCAN1_TXFIFOQ_INDEX]
  // }
};

/* FDCAN1 variable driver state */

static struct stm32_fdcan_s g_fdcan1priv;
static struct can_dev_s g_fdcan1dev;

#endif /* CONFIG_STM32H7_FDCAN1 */

#ifdef CONFIG_STM32H7_FDCAN2
/* FDCAN2 message RAM allocation */

static uint32_t g_fdcan2_msgram[FDCAN2_MSGRAM_WORDS]
#ifdef CONFIG_ARMV7M_DCACHE
  __attribute__((aligned(FDCAN_ALIGN)));
#else
  ;
#endif

/* FDCAN2 constant configuration */

static const struct stm32_config_s g_fdcan2const =
{
  .rxpinset         = GPIO_FDCAN2_RX,
  .txpinset         = GPIO_FDCAN2_TX,
  .base             = STM32_FDCAN2_BASE,
  .baud             = CONFIG_STM32H7_FDCAN2_BITRATE,
  .nbtp             = FDCAN_NBTP_NBRP(FDCAN2_NBRP) |
                      FDCAN_NBTP_NTSEG1(FDCAN2_NTSEG1) |
                      FDCAN_NBTP_NTSEG2(FDCAN2_NTSEG2) |
                      FDCAN_NBTP_NSJW(FDCAN2_NSJW),
  .dbtp             = FDCAN_DBTP_DBRP(FDCAN2_NBRP) |
                      FDCAN_DBTP_DTSEG1(FDCAN2_DTSEG1) |
                      FDCAN_DBTP_DTSEG2(FDCAN2_DTSEG2) |
                      FDCAN_DBTP_DSJW(FDCAN2_DSJW),
  .port             = 2,
  .irq0             = STM32_IRQ_FDCAN2_0,
  .irq1             = STM32_IRQ_FDCAN2_1,
#if defined(CONFIG_STM32H7_FDCAN2_CLASSIC)
  .mode             = FDCAN_CLASSIC_MODE,
#elif defined(CONFIG_STM32H7_FDCAN2_FD)
  .mode             = FDCAN_FD_MODE,
#else /* if defined(CONFIG_STM32H7_FDCAN2_FD_BRS) */
  .mode             = FDCAN_FD_BRS_MODE,
#endif
#if defined(CONFIG_STM32H7_FDCAN2_NONISO_FORMAT)
  .format           = FDCAN_NONISO_BOSCH_V1_FORMAT,
#else /* if defined(STM32H7_FDCAN2_ISO11898_1) */
  .fromat           = FDCAN_ISO11898_1_FORMAT,
#endif
  .nstdfilters      = CONFIG_STM32H7_FDCAN2_NSTDFILTERS,
  .nextfilters      = CONFIG_STM32H7_FDCAN2_NEXTFILTERS,
  .nrxfifo0         = CONFIG_STM32H7_FDCAN2_RXFIFO0_SIZE,
  .nrxfifo1         = CONFIG_STM32H7_FDCAN2_RXFIFO1_SIZE,
  .nrxdedicated     = CONFIG_STM32H7_FDCAN2_DEDICATED_RXBUFFER_SIZE,
  .ntxeventfifo     = CONFIG_STM32H7_FDCAN2_TXEVENTFIFO_SIZE,
  .ntxdedicated     = CONFIG_STM32H7_FDCAN2_DEDICATED_TXBUFFER_SIZE,
  .ntxfifoq         = CONFIG_STM32H7_FDCAN2_TXFIFOQ_SIZE,
  .rxfifo0ecode     = FDCAN2_RXFIFO0_ENCODED_SIZE,
  .rxfifo0esize     = (FDCAN2_RXFIFO0_ELEMENT_SIZE / 4) + 2,
  .rxfifo1ecode     = FDCAN2_RXFIFO1_ENCODED_SIZE,
  .rxfifo1esize     = (FDCAN2_RXFIFO1_ELEMENT_SIZE / 4) + 2,
  .rxbufferecode    = FDCAN2_RXBUFFER_ENCODED_SIZE,
  .rxbufferesize    = (FDCAN2_RXBUFFER_ELEMENT_SIZE / 4) + 2,
  .txbufferecode    = FDCAN2_TXBUFFER_ENCODED_SIZE,
  .txbufferesize    = (FDCAN2_TXBUFFER_ELEMENT_SIZE / 4) + 2,

#ifdef CONFIG_STM32H7_FDCAN2_LOOPBACK
  .loopback         = true,
#endif
  /* FDCAN1 Message RAM */

  .msgram =
  {
     &g_fdcan2_msgram[FDCAN2_STDFILTER_INDEX],
     &g_fdcan2_msgram[FDCAN2_EXTFILTERS_INDEX],
     &g_fdcan2_msgram[FDCAN2_RXFIFO0_INDEX],
     &g_fdcan2_msgram[FDCAN2_RXFIFO1_INDEX],
     &g_fdcan2_msgram[FDCAN2_RXDEDICATED_INDEX],
     &g_fdcan2_msgram[FDCAN2_TXEVENTFIFO_INDEX],
     &g_fdcan2_msgram[FDCAN2_TXDEDICATED_INDEX],
     &g_fdcan2_msgram[FDCAN2_TXFIFOQ_INDEX]
  }
};

/* FDCAN1 variable driver state */

static struct stm32_fdcan_s g_fdcan2priv;
static struct can_dev_s g_fdcan2dev;

#endif /* CONFIG_STM32H7_FDCAN2 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: fdcan_getreg
 *
 * Description:
 *   Read the value of a FDCAN register.
 *
 * Input Parameters:
 *   priv - A reference to the FDCAN peripheral state
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *
 ****************************************************************************/

#ifdef CONFIG_STM32H7_FDCAN_REGDEBUG
static uint32_t fdcan_getreg(FAR struct stm32_fdcan_s *priv, int offset)
{
  FAR const struct stm32_config_s *config = priv->config;
  uintptr_t regaddr;
  uint32_t regval;

  /* Read the value from the register */

  regaddr = config->base + offset;
  regval  = getreg32(regaddr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (regaddr == priv->regaddr && regval == priv->regval)
    {
      if (priv->count == 0xffffffff || ++priv->count > 3)
        {
          if (priv->count == 4)
            {
              caninfo("...\n");
            }

          return regval;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

      if (priv->count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          caninfo("[repeats %d more times]\n", priv->count - 3);
        }

      /* Save the new address, value, and count */

      priv->regaddr = regaddr;
      priv->regval  = regval;
      priv->count   = 1;
    }

  /* Show the register value read */

