apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
  caninfo("%08x->%08x\n", regaddr, regval);
  return regval;
}

#else
static uint32_t fdcan_getreg(FAR struct stm32_fdcan_s *priv, int offset)
{
  FAR const struct stm32_config_s *config = priv->config;
  return getreg32(config->base + offset);
}

#endif

/****************************************************************************
 * Name: fdcan_putreg
 *
 * Description:
 *   Set the value of a FDCAN register.
 *
 * Input Parameters:
 *   priv - A reference to the FDCAN peripheral state
 *   offset - The offset to the register to write
 *   regval - The value to write to the register
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_STM32H7_FDCAN_REGDEBUG
static void fdcan_putreg(FAR struct stm32_fdcan_s *priv, int offset,
                        uint32_t regval)
{
  FAR const struct stm32_config_s *config = priv->config;
  uintptr_t regaddr = config->base + offset;

  /* Show the register value being written */

  caninfo("%08x<-%08x\n", regaddr, regval);

  /* Write the value */

  putreg32(regval, regaddr);
}

#else
static void fdcan_putreg(FAR struct stm32_fdcan_s *priv, int offset,
                        uint32_t regval)
{
  FAR const struct stm32_config_s *config = priv->config;
  putreg32(regval, config->base + offset);
}

#endif

/****************************************************************************
 * Name: fdcan_dumpctrlregs
 *
 * Description:
 *   Dump the contents of all CAN control registers
 *
 * Input Parameters:
 *   priv - A reference to the CAN block status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_STM32H7_FDCAN_REGDEBUG
static void fdcan_dumpregs(FAR struct stm32_fdcan_s *priv,
                                  FAR const char *msg)
{  
  FAR const struct stm32_config_s *config = priv->config;

  caninfo("CAN%d Control and Status Registers: %s\n", config->port, msg);
  caninfo("  Base: %08x\n", config->base);

  /* CAN control and status registers */

  caninfo("  CCCR:  %08x   TEST:  %08x\n",
          getreg32(config->base + STM32_FDCAN_CCCR_OFFSET),
          getreg32(config->base + STM32_FDCAN_TEST_OFFSET));

  caninfo("  NBTP:  %08x   DBTP:  %08x\n",
          getreg32(config->base + STM32_FDCAN_NBTP_OFFSET),
          getreg32(config->base + STM32_FDCAN_DBTP_OFFSET));

  caninfo("  IE:    %08x   ILE:   %08x    ILS:  %08x\n",
          getreg32(config->base + STM32_FDCAN_IE_OFFSET),
          getreg32(config->base + STM32_FDCAN_ILE_OFFSET),
          getreg32(config->base + STM32_FDCAN_ILS_OFFSET));

  caninfo("  PSR:   %08x   ECR:   %08x\n",
          getreg32(config->base + STM32_FDCAN_PSR_OFFSET),
          getreg32(config->base + STM32_FDCAN_ECR_OFFSET));

  caninfo("  HPMS:  %08x   RXF0S: %08x   RXF1S: %08x\n",
          getreg32(config->base + STM32_FDCAN_HPMS_OFFSET),
          getreg32(config->base + STM32_FDCAN_RXF0S_OFFSET),
          getreg32(config->base + STM32_FDCAN_RXF1S_OFFSET));

  caninfo("  TXFQS: %08x   TXEFS: %08x\n",
          getreg32(config->base + STM32_FDCAN_TXFQS_OFFSET),
          getreg32(config->base + STM32_FDCAN_TXEFS_OFFSET));
}
#endif

/****************************************************************************
 * Name: stm32can_dumprxregs
 *
 * Description:
 *   Dump the contents of all Rx status registers
 *
 * Input Parameters:
 *   priv - A reference to the CAN block status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_STM32H7_FDCAN_REGDEBUG
static void fdcan_dumprxregs(FAR struct stm32_fdcan_s *priv,
                                FAR const char *msg)
{
  FAR const struct stm32_config_s *config = priv->config;

  caninfo("CAN%d Rx Registers: %s\n", config->port, msg);
  caninfo("  Base: %08x\n", config->base);


  caninfo("  RXESC: %08x   RXF0S: %08x   RXF1S: %08x\n",
          getreg32(config->base + STM32_FDCAN_RXESC_OFFSET),
          getreg32(config->base + STM32_FDCAN_RXF0S_OFFSET),
          getreg32(config->base + STM32_FDCAN_RXF1S_OFFSET));

  caninfo("  IR:    %08x   IE:    %08x\n",
          getreg32(config->base + STM32_FDCAN_IR_OFFSET),
          getreg32(config->base + STM32_FDCAN_IE_OFFSET));
}
#endif

/****************************************************************************
 * Name: stm32can_dumptxregs
 *
 * Description:
 *   Dump the contents of all Tx buffer registers
 *
 * Input Parameters:
 *   priv - A reference to the CAN block status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_STM32H7_FDCAN_REGDEBUG
static void fdcan_dumptxregs(FAR struct stm32_fdcan_s *priv,
                                  FAR const char *msg)
{
  FAR const struct stm32_config_s *config = priv->config;

  caninfo("CAN%d Tx Registers: %s\n", config->port, msg);
  caninfo("  Base: %08x\n", config->base);

  caninfo("  TXQFS: %08x  TXBAR: %08x  TXBRP: %08x\n",
          getreg32(config->base + STM32_FDCAN_TXFQS_OFFSET),
          getreg32(config->base + STM32_FDCAN_TXBAR_OFFSET),
          getreg32(config->base + STM32_FDCAN_TXBRP_OFFSET));
  
  caninfo("  TXBTO: %08x  TXBCR: %08x  TXBCF: %08x\n",
          getreg32(config->base + STM32_FDCAN_TXBTO_OFFSET),
          getreg32(config->base + STM32_FDCAN_TXBCR_OFFSET),
          getreg32(config->base + STM32_FDCAN_TXBCF_OFFSET));

  caninfo("  TIE:   %08x\n",
          getreg32(config->base + STM32_FDCAN_TXBTIE_OFFSET));
}
#endif

/****************************************************************************
 * Name: stm32can_showramlayout
 *
 * Description:
 *   Print the layout of the message RAM
 *
 * Input Parameters:
 *   priv - A reference to the CAN block status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_STM32H7_FDCAN_REGDEBUG
static void fdcan_dumpramlayout(FAR struct stm32_fdcan_s *priv)
{
  FAR const struct stm32_config_s *config = priv->config;

  caninfo(" ******* FDCAN%d Message RAM layout *******\n", config->port);
  caninfo("                Start   # Elmnt  Elmnt size\n");

#if CONFIG_STM32H7_FDCAN1_NSTDFILTERS > 0
  caninfo("STD filters   %p   %4d      %2d\n",
          config->msgram.stdfilters,
          config->nstdfilters,
          1);
#endif

#if CONFIG_STM32H7_FDCAN1_NEXTFILTERS > 0
  caninfo("EXT filters   %p   %4d      %2d\n",
          config->msgram.extfilters,
          config->nextfilters,
          2);
#endif

