apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
#if CONFIG_STM32H7_FDCAN1_RXFIFO0_SIZE > 0
  caninfo("RX FIFO 0     %p   %4d      %2d\n",
          config->msgram.rxfifo0,
          config->nrxfifo0,
          config->rxfifo0esize);
#endif

#if CONFIG_STM32H7_FDCAN1_RXFIFO1_SIZE
  caninfo("RX FIFO 1     %p   %4d      %2d\n",
          config->msgram.rxfifo1,
          config->nrxfifo1,
          config->rxfifo1esize);
#endif

#if CONFIG_STM32H7_FDCAN1_DEDICATED_RXBUFFER_SIZE > 0
  caninfo("RX Buffers    %p   %4d      %2d\n",
          config->msgram.rxdedicated,
          config->nrxdedicated,
          config->rxbufferesize);
#endif

#if CONFIG_STM32H7_FDCAN1_TXFIFOQ_SIZE > 0
  caninfo("TX FIFO       %p   %4d      %2d\n",
          config->msgram.txfifoq,
          config->ntxfifoq,
          config->txbufferesize);
#endif
}
#endif

/****************************************************************************
 * Name: fdcan_dev_lock
 *
 * Description:
 *   Take the semaphore that enforces mutually exclusive access to device
 *   structures, handling any exceptional conditions
 *
 * Input Parameters:
 *   priv - A reference to the FDCAN peripheral state
 *
 * Returned Value:
 *  Normally success (OK) is returned, but the error -ECANCELED may be
 *  return in the event that task has been canceled.
 *
 ****************************************************************************/

static int fdcan_dev_lock(FAR struct stm32_fdcan_s *priv)
{
  return nxsem_wait_uninterruptible(&priv->locksem);
}

/****************************************************************************
 * Name: fdcan_dev_lock_noncancelable
 *
 * Description:
 *   This is just a wrapper to handle the annoying behavior of semaphore
 *   waits that return due to the receipt of a signal.  This version also
 *   ignores attempts to cancel the thread.
 *
 ****************************************************************************/

static int fdcan_dev_lock_noncancelable(FAR struct stm32_fdcan_s *priv)
{
  int result;
  int ret = OK;

  do
    {
      result = nxsem_wait_uninterruptible(&priv->locksem);

      /* The only expected error is ECANCELED which would occur if the
       * calling thread were canceled.
       */

      DEBUGASSERT(result == OK || result == -ECANCELED);
      if (ret == OK && result < 0)
        {
          ret = result;
        }
    }
  while (result < 0);

  return ret;
}

/****************************************************************************
 * Name: fdcan_buffer_reserve
 *
 * Description:
 *   Take the semaphore, decrementing the semaphore count to indicate that
 *   one fewer TX FIFOQ buffer is available.  Handles any exceptional
 *   conditions.
 *
 * Input Parameters:
 *   priv - A reference to the FDCAN peripheral state
 *
 * Returned Value:
 *  None
 *
 * Assumptions:
 *  Called only non-interrupt logic via fdcan_write().  We do not have
 *  exclusive access to the FDCAN hardware and interrupts are not disabled.
 *  fdcan_write() does lock the scheduler for reasons noted below.
 *
 ****************************************************************************/

static void fdcan_buffer_reserve(FAR struct stm32_fdcan_s *priv)
{
  irqstate_t flags;
  uint32_t txfqs1;
  uint32_t txfqs2;
#ifndef CONFIG_STM32H7_FDCAN_QUEUE_MODE
  int tffl;
#endif
  int sval;
  int ret;

  /* Wait until we successfully get the semaphore.  EINTR is the only
   * expected 'failure' (meaning that the wait for the semaphore was
   * interrupted by a signal.
   */

  do
    {
      /* We take some extra precautions here because it is possible that on
       * certain error conditions, the semaphore count could get out of
       * phase with the actual count of elements in the TX FIFO (I have
       * never seen this happen, however.  My paranoia).
       *
       * An missed TX interrupt could cause the semaphore count to fail to
       * be incremented and, hence, to be too low.
       */

      for (; ; )
        {
          /* Get the current queue status and semaphore count. */

          flags = enter_critical_section();
          txfqs1 = fdcan_getreg(priv, STM32_FDCAN_TXFQS_OFFSET);
          nxsem_get_value(&priv->txfsem, &sval);
          txfqs2 = fdcan_getreg(priv, STM32_FDCAN_TXFQS_OFFSET);

          /* If the semaphore count and the TXFQS samples are in
           * sync, then break out of the look with interrupts
           * disabled.
           */

          if (txfqs1 == txfqs2)
            {
              break;
            }

          /* Otherwise, re-enable interrupts to interrupts that may
           * resynchronize, the semaphore count and try again.
           */

          leave_critical_section(flags);
        }

#ifdef CONFIG_STM32H7_FDCAN_QUEUE_MODE
      /* We only have one useful bit of information in the TXFQS:
       * Is the TX FIFOQ full or not?  We can only do limited checks
       * with that single bit of information.
       */

      if ((txfqs1 & FDCAN_TXFQS_TFQF) != 0)
        {
          /* The TX FIFOQ is full.  The semaphore count should then be
           * less than or equal to zero.  If it is greater than zero,
           * then reinitialize it to 0.
           */

          if (sval > 0)
            {
              canerr("ERROR: TX FIFOQ full but txfsem is %d\n", sval);
              nxsem_reset(&priv->txfsem, 0);
            }
        }

      /* The FIFO is not full so the semaphore count should be greater
       * than zero.  If it is not, then we have missed a call to
       * fdcan_buffer_release(0).
       *
       * NOTE: Since there is no mutual exclusion, it might be possible
       * that fdcan_write() could be re-entered AFTER taking the semaphore
       * and dropping the count to zero, but BEFORE adding the message
       * to the TX FIFOQ.  That corner case is handled in fdcan_write() by
       * locking the scheduler.
       */

      else if (sval <= 0)
        {
          canerr("ERROR: TX FIFOQ not full but txfsem is %d\n", sval);

          /* Less than zero means that another thread is waiting */

          if (sval < 0)
            {
              /* Bump up the count by one and try again */

              nxsem_post(&priv->txfsem);
              leave_critical_section(flags);
              continue;
            }

          /* Exactly zero but the FIFO is not full.  Just return without
           * decrementing the count.
           */

          leave_critical_section(flags);
          return;
        }
#else
      /* Tx FIFO Free Level */

      tffl = (txfqs1 & FDCAN_TXFQS_TFFL_MASK) >> FDCAN_TXFQS_TFFL_SHIFT;

      /* Check if the configured number is less than the number of buffers
       * in the chip
       */

