apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
          /* Format and write filter word F0 */

          DEBUGASSERT(extconfig->xf_id1 <= CAN_MAX_EXTMSGID);
          regval = EXTFILTER_F0_EFID1(extconfig->xf_id1);

          if (extconfig->xf_prio == 0)
            {
              regval |= EXTFILTER_F0_EFEC_FIFO0;
            }
          else
            {
              regval |= EXTFILTER_F0_EFEC_FIFO0;
            }

          extfilter[0] = regval;

          /* Format and write filter word F1 */

          DEBUGASSERT(extconfig->xf_id2 <= CAN_MAX_EXTMSGID);
          regval = EXTFILTER_F1_EFID2(extconfig->xf_id2);

          switch (extconfig->xf_type)
            {
              default:
              case CAN_FILTER_DUAL:
                regval |= EXTFILTER_F1_EFT_DUAL;
                break;

              case CAN_FILTER_MASK:
                regval |= EXTFILTER_F1_EFT_CLASSIC;
                break;
              case CAN_FILTER_RANGE:
                regval |= EXTFILTER_F1_EFT_RANGE;
                break;
            }

          extfilter[1] = regval;

          /* Flush the filter entry into physical RAM */

          up_clean_dcache((uintptr_t)extfilter, (uintptr_t)exfilter + 8);

          /* Is this the first extended filter? */

          if (priv->nextalloc == 1)
            {
              /* Enable the Initialization state */

              regval  = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
              regval |= FDCAN_CCCR_INIT;
              fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);

              /* Wait for initialization mode to take effect */

              while ((fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET) &
                     FDCAN_CCCR_INIT) == 0)
                {
                }

              /* Enable writing to configuration registers */

              regval  = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
              regval |= (FDCAN_CCCR_INIT | FDCAN_CCCR_CCE);
              fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);

             /* Update the Global Filter Configuration so that received
              * messages are rejected if they do not match the acceptance
              * filter.
              *
              *   ANFE=2: Discard all rejected frames
              */

              regval  = fdcan_getreg(priv, STM32_FDCAN_GFC_OFFSET);
              regval &= ~FDCAN_GFC_ANFE_MASK;
              regval |= FDCAN_GFC_ANFE_REJECTED;
              fdcan_putreg(priv, STM32_FDCAN_GFC_OFFSET, regval);

              /* Disable writing to configuration registers */

              regval  = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
              regval &= ~(FDCAN_CCCR_INIT | FDCAN_CCCR_CCE);
              fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);
            }

          fdcan_dev_unlock(priv);
          return ndx;
        }
    }

  DEBUGASSERT(priv->nextalloc == priv->config->nextfilters);
  fdcan_dev_unlock(priv);
  return -EAGAIN;
}
#endif

/****************************************************************************
 * Name: fdcan_del_extfilter
 *
 * Description:
 *   Remove an address filter for a standard 29 bit address.
 *
 * Input Parameters:
 *   priv - An instance of the FDCAN driver state structure.
 *   ndx  - The filter index previously returned by the fdcan_add_extfilter().
 *
 * Returned Value:
 *   Zero (OK) is returned on success.  Otherwise a negated errno value is
 *   returned to indicate the nature of the error.
 *
 ****************************************************************************/

#ifdef CONFIG_CAN_EXTID
static int fdcan_del_extfilter(FAR struct stm32_fdcan_s *priv, int ndx)
{
  FAR const struct stm32_config_s *config;
  FAR uint32_t *extfilter;
  uint32_t regval;
  int word;
  int bit;

  DEBUGASSERT(priv != NULL && priv->config != NULL);
  config = priv->config;

  /* Check user Parameters */

  DEBUGASSERT(ndx >= 0 || ndx < config->nextfilters);

  if (ndx < 0 || ndx >= config->nextfilters)
    {
      return -EINVAL;
    }

  /* Get exclusive excess to the FDCAN hardware */

  ret = fdcan_dev_lock(priv);
  if (ret < 0)
    {
      return ret;
    }

  word = ndx >> 5;
  bit  = ndx & 0x1f;

  /* Check if this filter is really assigned */

  if ((priv->extfilters[word] & (1 << bit)) == 0)
    {
      /* No, error out */

      fdcan_dev_unlock(priv);
      return -ENOENT;
    }

  /* Release the filter */

  priv->extfilters[word] &= ~(1 << bit);

  DEBUGASSERT(priv->nextalloc > 0);
  priv->nextalloc--;

  /* Was that the last extended filter? */

  if (priv->nextalloc == 0)
    {
      /* Enable the Initialization state */

      regval  = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
      regval |= FDCAN_CCCR_INIT;
      fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);

      /* Wait for initialization mode to take effect */

      while ((fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET) &
             FDCAN_CCCR_INIT) == 0)
        {
        }

      /* Enable writing to configuration registers */

      regval  = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
      regval |= (FDCAN_CCCR_INIT | FDCAN_CCCR_CCE);
      fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);

      /* If there are no extended filters, then modify Global Filter
       * Configuration so that all rejected messages are places in RX
       * FIFO0.
       *
       *   ANFE=0: Store all rejected extended frame in RX FIFO0
       */

      regval  = fdcan_getreg(priv, STM32_FDCAN_GFC_OFFSET);
      regval &= ~FDCAN_GFC_ANFE_MASK;
      regval |= FDCAN_GFC_ANFE_RX_FIFO0;
      fdcan_putreg(priv, STM32_FDCAN_GFC_OFFSET, regval);

      /* Disable writing to configuration registers */

      regval  = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
      regval &= ~(FDCAN_CCCR_INIT | FDCAN_CCCR_CCE);
      fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);
    }

  /* Deactivate the filter last so that no messages are lost. */

  extfilter    = config->msgram.extfilters + (ndx << 1);
  *extfilter++ = 0;
  *extfilter   = 0;

  fdcan_dev_unlock(priv);
  return OK;
}
#endif

/****************************************************************************
 * Name: fdcan_add_stdfilter
 *
 * Description:
 *   Add an address filter for a standard 11 bit address.
 *
 * Input Parameters:
 *   priv      - An instance of the FDCAN driver state structure.
 *   stdconfig - The configuration of the standard filter
 *
 * Returned Value:
 *   A non-negative filter ID is returned on success.  Otherwise a negated
 *   errno value is returned to indicate the nature of the error.
 *
 ****************************************************************************/

