apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
  DEBUGASSERT(priv);

  /* Get exclusive access to the FDCAN peripheral */

  ret = fdcan_dev_lock(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* only start BUS-OFF recovery if we are in BUS-OFF state */

  regval = fdcan_getreg(priv, STM32_FDCAN_PSR_OFFSET);
  if (!(regval & FDCAN_PSR_BO))
    {
      fdcan_dev_unlock(priv);
      return -EPERM;
    }

  /* Disable initialization mode to issue the recovery sequence */

  regval = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
  regval &= ~FDCAN_CCCR_INIT;
  fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);

  fdcan_dev_unlock(priv);
  return OK;
}

/****************************************************************************
 * Name: fdcan_reset
 *
 * Description:
 *   Reset the FDCAN device.  Called early to initialize the hardware. This
 *   function is called, before fdcan_setup() and on error conditions.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *  None
 *
 ****************************************************************************/

static void fdcan_reset(FAR struct can_dev_s *dev)
{
  FAR struct stm32_fdcan_s *priv;
  FAR const struct stm32_config_s *config;
  uint32_t regval;

  DEBUGASSERT(dev);
  priv = dev->cd_priv;
  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  caninfo("FDCAN%d\n", config->port);
  UNUSED(config);

  /* Get exclusive access to the FDCAN peripheral */

  fdcan_dev_lock_noncancelable(priv);

  /* Disable all interrupts */

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, 0);
  fdcan_putreg(priv, STM32_FDCAN_TXBTIE_OFFSET, 0);

  /* Make sure that all buffers are released.
   *
   * REVISIT: What if a thread is waiting for a buffer?  The following
   * will not wake up any waiting threads.
   */

  nxsem_destroy(&priv->txfsem);
  nxsem_init(&priv->txfsem, 0, config->ntxfifoq);

  /* Disable peripheral clocking to the FDCAN controller */

  // sam_disableperiph1(priv->config->pid); //TODO: check this

   /* Reset the FD CAN */

  regval  = getreg32(STM32_RCC_APB1HRSTR);
  regval |= RCC_APB1HRSTR_FDCANRST;
  putreg32(regval, STM32_RCC_APB1HRSTR);

  regval &= ~RCC_APB1HRSTR_FDCANRST;
  putreg32(regval, STM32_RCC_APB1HRSTR);

  priv->state = FDCAN_STATE_RESET;
  fdcan_dev_unlock(priv);
}

/****************************************************************************
 * Name: fdcan_setup
 *
 * Description:
 *   Configure the FDCAN. This method is called the first time that the FDCAN
 *   device is opened.  This will occur when the port is first opened.
 *   This setup includes configuring and attaching FDCAN interrupts.
 *   All FDCAN interrupts are disabled upon return.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int fdcan_setup(FAR struct can_dev_s *dev)
{
  FAR struct stm32_fdcan_s *priv;
  FAR const struct stm32_config_s *config;
  int ret;

  DEBUGASSERT(dev);
  priv = dev->cd_priv;
  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  caninfo("FDCAN%d\n", config->port);

  /* Get exclusive access to the FDCAN peripheral */

  ret = fdcan_dev_lock(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* FDCAN hardware initialization */

  ret = fdcan_hw_initialize(priv);
  if (ret < 0)
    {
      canerr("ERROR: FDCAN%d H/W initialization failed: %d\n",
             config->port, ret);
      return ret;
    }

  fdcan_dumpregs(priv, "After hardware initialization");

  /* Attach the FDCAN interrupt handlers */

  ret = irq_attach(config->irq0, fdcan_interrupt, dev);
  if (ret < 0)
    {
      canerr("ERROR: Failed to attach FDCAN%d line 0 IRQ (%d)",
      config->port, config->irq0);
      return ret;
    }

  ret = irq_attach(config->irq1, fdcan_interrupt, dev);
  if (ret < 0)
    {
      canerr("ERROR: Failed to attach FDCAN%d line 1 IRQ (%d)",
      config->port, config->irq1);
      return ret;
    }

  /* Enable receive interrupts */

  priv->state = FDCAN_STATE_SETUP;
  fdcan_rxint(dev, true);

  fdcan_dumpregs(priv, "After receive setup");

  /* Enable the interrupts at the NVIC (they are still disabled at the FDCAN
   * peripheral).
   */

  up_enable_irq(config->irq0);
  up_enable_irq(config->irq1);
  fdcan_dev_unlock(priv);
  return OK;
}

/****************************************************************************
 * Name: fdcan_shutdown
 *
 * Description:
 *   Disable the FDCAN.  This method is called when the FDCAN device is closed.
 *   This method reverses the operation the setup method.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void fdcan_shutdown(FAR struct can_dev_s *dev)
{
  FAR struct stm32_fdcan_s *priv;
  FAR const struct stm32_config_s *config;

  DEBUGASSERT(dev);
  priv = dev->cd_priv;
  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  caninfo("FDCAN%d\n", config->port);

  /* Get exclusive access to the FDCAN peripheral */

  fdcan_dev_lock_noncancelable(priv);

  /* Disable FDCAN interrupts at the NVIC */

  up_disable_irq(config->irq0);
  up_disable_irq(config->irq1);

  /* Disable all interrupts from the FDCAN peripheral */

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, 0);
  fdcan_putreg(priv, STM32_FDCAN_TXBTIE_OFFSET, 0);

  /* Detach the FDCAN interrupt handler */

  irq_detach(config->irq0);
  irq_detach(config->irq1);

  /* Disable peripheral clocking to the FDCAN controller */

  // sam_disableperiph1(priv->config->pid); //TODO: check this
  fdcan_dev_unlock(priv);
}

/****************************************************************************
 * Name: fdcan_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void fdcan_rxint(FAR struct can_dev_s *dev, bool enable)
{
  FAR struct stm32_fdcan_s *priv = dev->cd_priv;
  irqstate_t flags;
  uint32_t regval;

  DEBUGASSERT(priv && priv->config);

