apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
#ifdef CONFIG_CAN_ERRORS
  hdr.ch_error  = 0;
#endif
  hdr.ch_unused = 0;

  if ((regval & BUFFER_R0_RTR) != 0)
    {
      hdr.ch_rtr = true;
    }
  else
    {
      hdr.ch_rtr = false;
    }

#ifdef CONFIG_CAN_EXTID
  if ((regval & BUFFER_R0_XTD) != 0)
    {
      /* Save the extended ID of the newly received message */

      hdr.ch_id    = (regval & BUFFER_R0_EXTID_MASK) >>
                     BUFFER_R0_EXTID_SHIFT;
      hdr.ch_extid = true;
    }
  else
    {
      hdr.ch_id    = (regval & BUFFER_R0_STDID_MASK) >>
                     BUFFER_R0_STDID_SHIFT;
      hdr.ch_extid = false;
    }

#else
  if ((regval & BUFFER_R0_XTD) != 0)
    {
      /* Drop any messages with extended IDs */

      return;
    }

  /* Save the standard ID of the newly received message */

  hdr.ch_id = (regval & BUFFER_R0_STDID_MASK) >> BUFFER_R0_STDID_SHIFT;
#endif

  /* Word R1 contains the DLC and timestamp */

  regval = *rxbuffer++;
  reginfo("R1: %08x\n", regval);

  hdr.ch_dlc = (regval & BUFFER_R1_DLC_MASK) >> BUFFER_R1_DLC_SHIFT;

  /* And provide the CAN message to the upper half logic */

  ret = can_receive(dev, &hdr, (FAR uint8_t *)rxbuffer);
  if (ret < 0)
    {
      canerr("ERROR: can_receive failed: %d\n", ret);
    }
}

/****************************************************************************
 * Name: fdcan_interrupt
 *
 * Description:
 *   Common FDCAN interrupt handler
 *
 * Input Parameters:
 *   dev - CAN-common state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int fdcan_interrupt(int irq, void *context, FAR void *arg)
{
  FAR struct can_dev_s *dev = (FAR struct can_dev_s *)arg;
  FAR struct stm32_fdcan_s *priv;
  FAR const struct stm32_config_s *config;
  uint32_t ir;
  uint32_t ie;
  uint32_t pending;
  uint32_t regval;
  unsigned int nelem;
  unsigned int ndx;
  bool handled;

  DEBUGASSERT(dev != NULL);
  priv = dev->cd_priv;
  DEBUGASSERT(priv && priv->config);
  config = priv->config;

  fdcan_dumprxregs(priv, "RX interrupt");
  fdcan_dumpregs(priv, "RX interrupt");

  /* Loop while there are pending interrupt events */

  do
    {
      /* Get the set of pending interrupts. */

      ir = fdcan_getreg(priv, STM32_FDCAN_IR_OFFSET);
      ie = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);

      pending = (ir & ie);
      handled = false;

      /* Check for any errors */

      if ((pending & FDCAN_ANYERR_INTS) != 0)
        {
          /* Check for common errors */

          if ((pending & FDCAN_CMNERR_INTS) != 0)
            {
              canerr("ERROR: Common %08x\n", pending & FDCAN_CMNERR_INTS);

              /* Clear the error indications */

              fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_CMNERR_INTS);
            }

          /* Check for transmission errors */

          if ((pending & FDCAN_TXERR_INTS) != 0)
            {
              canerr("ERROR: TX %08x\n", pending & FDCAN_TXERR_INTS);

              /* An Acknowledge-Error will occur if for example the device
               * is not connected to the bus.
               *
               * The CAN-Standard states that the Chip has to retry the
               * message forever, which will produce an ACKE every time.
               * To prevent this Interrupt-Flooding and the high CPU-Load
               * we disable the ACKE here as long we didn't transfer at
               * least one message successfully (see FDCAN_INT_TC below).
               */

              //TODO: 
              // ie &= ~FDCAN_INT_ACKE;
              // fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, ie);

              /* Clear the error indications */

              fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_TXERR_INTS);

              /* REVISIT:  Will FDCAN_INT_TC also be set in the event of
               * a transmission error?  Each write must conclude with a
               * call to man_buffer_release(), whether or not the write
               * was successful.
               *
               * We assume that FDCAN_INT_TC will be called for each
               * message buffer. Except the transfer is cancelled.
               * TODO: add handling for FDCAN_INT_TCF
               */
            }

          /* Check for reception errors */

          if ((pending & FDCAN_RXERR_INTS) != 0)
            {
              canerr("ERROR: RX %08x\n", pending & FDCAN_RXERR_INTS);

              /* To prevent Interrupt-Flooding the current active
               * RX error interrupts are disabled. After successfully
               * receiving at least one CAN packet all RX error interrupts
               * are turned back on.
               *
               * The Interrupt-Flooding can for example occur if the
               * configured CAN speed does not match the speed of the other
               * CAN nodes in the network.
               */

              ie &= ~(pending & FDCAN_RXERR_INTS);
              fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, ie);

              /* Clear the error indications */

              fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_RXERR_INTS);
            }

#ifdef CONFIG_CAN_ERRORS
          /* Report errors */

          fdcan_error(dev, pending & FDCAN_ANYERR_INTS);
#endif
          handled = true;
        }

      /* Check for successful completion of a transmission */

      if ((pending & FDCAN_INT_TC) != 0)
        {
          /* Check if we have disabled the ACKE in the error-handling above
           * (see FDCAN_TXERR_INTS) to prevent Interrupt-Flooding and
           * re-enable the error interrupt here again.
           */

          //TODO: 
          // if ((ie & FDCAN_INT_ACKE) == 0)
          //   {
          //       ie |= FDCAN_INT_ACKE;
          //       fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, ie);
          //   }

          /* Clear the pending TX completion interrupt (and all
           * other TX-related interrupts)
           */

          fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, priv->txints);

          /* Indicate that there is one more buffer free in the TX FIFOQ by
           * "releasing" it.  This may have the effect of waking up a thread
           * that has been waiting for a free TX FIFOQ buffer.
           *
           * REVISIT: TX dedicated buffers are not supported.
           */

          fdcan_buffer_release(priv);
          handled = true;

#ifdef CONFIG_CAN_TXREADY
          /* Inform the upper half driver that we are again ready to accept
           * data in fdcan_send().
           */

          can_txready(dev);
#endif
        }
      else if ((pending & priv->txints) != 0)
        {
          /* Clear unhandled TX events */

          fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, priv->txints);
          handled = true;
        }

#if 0 /* Not used */
      /* Check if a message has been stored to the dedicated RX buffer (DRX) */

      if ((pending & FDCAN_INT_DRX) != 0)
        {
          int i;

          /* Clear the pending DRX interrupt */

          fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_INT_DRX);

