apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
  /* Disable all interrupts  */

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, 0);
  fdcan_putreg(priv, STM32_FDCAN_TXBTIE_OFFSET, 0);

  /* All interrupts directed to Line 0.  But disable both interrupt lines 0
   * and 1 for now.
   *
   * REVISIT: Only interrupt line 0 is used by this driver.
   */

  fdcan_putreg(priv, STM32_FDCAN_ILS_OFFSET, 0);
  fdcan_putreg(priv, STM32_FDCAN_ILE_OFFSET, 0);

  /* Clear all pending interrupts. */

  fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_INT_ALL);

  /* Configure FDCAN bit timing */

  fdcan_putreg(priv, STM32_FDCAN_NBTP_OFFSET, priv->nbtp);
  fdcan_putreg(priv, STM32_FDCAN_DBTP_OFFSET, priv->dbtp);

  /* Configure message RAM starting addresses and sizes. */

  regval = FDCAN_SIDFC_FLSSA(config->stdfiltersstart) |
           FDCAN_SIDFC_LSS(config->nstdfilters);
  fdcan_putreg(priv, STM32_FDCAN_SIDFC_OFFSET, regval);

  regval = FDCAN_XIDFC_FLESA(config->extfiltersstart) |
           FDCAN_XIDFC_LSE(config->nextfilters);
  fdcan_putreg(priv, STM32_FDCAN_XIDFC_OFFSET, regval);

  /* Configure RX FIFOs */

  regval = FDCAN_RXFC_FSA(config->rxfifo0start) |
           FDCAN_RXFC_FS(config->nrxfifo0);
  fdcan_putreg(priv, STM32_FDCAN_RXF0C_OFFSET, regval);
  
  regval = FDCAN_RXFC_FSA(config->rxfifo1start) |
           FDCAN_RXFC_FS(config->nrxfifo1);
  fdcan_putreg(priv, STM32_FDCAN_RXF1C_OFFSET, regval);

  /* Watermark interrupt off, blocking mode */

  regval = FDCAN_RXBC_RBSA((uint32_t)config->rxbufferstart);
  fdcan_putreg(priv, STM32_FDCAN_RXBC_OFFSET, regval);

  regval = FDCAN_TXEFC_EFSA((uint32_t)config->txeventstart) |
           FDCAN_TXEFC_EFS(config->ntxeventfifo);
  fdcan_putreg(priv, STM32_FDCAN_TXEFC_OFFSET, regval);

  /* Watermark interrupt off */

  regval = FDCAN_TXBC_TBSA(config->txbufferstart) |
           FDCAN_TXBC_NDTB(config->ntxdedicated) |
           FDCAN_TXBC_TFQS(config->ntxfifoq);
  fdcan_putreg(priv, STM32_FDCAN_TXBC_OFFSET, regval);

  regval = FDCAN_RXESC_RBDS(config->rxbufferecode) |
           FDCAN_RXESC_F1DS(config->rxfifo1ecode) |
           FDCAN_RXESC_F0DS(config->rxfifo0ecode);
  fdcan_putreg(priv, STM32_FDCAN_RXESC_OFFSET, regval);

  regval = FDCAN_TXESC_TBDS(config->txbufferecode);
  fdcan_putreg(priv, STM32_FDCAN_TXESC_OFFSET, regval);

  /* Dump Message RAM layout */
  fdcan_dumpramlayout(priv);

  /* Configure Message Filters */

  /* Disable all standard filters */

  msgram = config->msgram.stdfilters;
  cntr   = config->nstdfilters;
  while (cntr > 0)
    {
      *msgram++ = STDFILTER_S0_SFEC_DISABLE;
      cntr--;
    }

  /* Disable all extended filters */

  msgram = config->msgram.extfilters;
  cntr = config->nextfilters;
  while (cntr > 0)
    {
      *msgram = EXTFILTER_F0_EFEC_DISABLE;
      msgram = msgram + 2;
      cntr--;
    }

  /* Clear new RX data flags */

  fdcan_putreg(priv, STM32_FDCAN_NDAT1_OFFSET, 0xffffffff);
  fdcan_putreg(priv, STM32_FDCAN_NDAT2_OFFSET, 0xffffffff);

  /* TTCAN configuration (FDCAN1 only) */

  if(config->port == 1)
    {
      /* Disable TTCAN operation */

      regval = fdcan_getreg(priv, STM32_FDCAN_TTOCF_OFFSET);
      regval &= ~FDCAN_TTOCF_OM_MASK;
      fdcan_putreg(priv, STM32_FDCAN_TTOCF_OFFSET, regval);
    }
  
  /* CCU configuration */ /*REVIST: shared CCU config between cores */

  regval = getreg32(STM32_FDCAN_CCU_CCFG);
  regval |= FDCAN_CCU_CCFG_BCC;
  putreg32(regval, STM32_FDCAN_CCU_CCFG);


  /* Clear to CCCR defaults in preparation of selection of frame
   * format and mode 
   */

  regval  = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
  regval &= ~(FDCAN_CCCR_NISO | FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE);

  /* Select ISO11898-1 or Non ISO Bosch CAN FD Specification V1.0 */

    switch (config->format)
    {
    default:
    case FDCAN_ISO11898_1_FORMAT:
      break;

    case FDCAN_NONISO_BOSCH_V1_FORMAT:
      regval |= FDCAN_CCCR_NISO;
      break;
    }


  /* Select Classic CAN mode or FD mode with or without fast bit rate
   * switching
   */

  switch (config->mode)
    {
    default:
    case FDCAN_CLASSIC_MODE:
      break;

#ifdef CONFIG_CAN_FD
    case FDCAN_FD_MODE:
      regval |= FDCAN_CCCR_FDOE;
      break;

    case FDCAN_FD_BRS_MODE:
      regval |= (FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE);
      break;
#endif
    }

  /* Set the initial CAN mode */

  fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);

  /* Request the mode change */
  //TODO:
  // regval |= cmr;
  // fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);

#if 0 /* Not necessary in initialization mode */
  /* Wait for the mode to take effect */

  while ((fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET) &
         (FDCAN_CCCR_FDBS | FDCAN_CCCR_FDO)) != 0);
#endif

  /* Enable FIFO/Queue mode
   *
   * REVISIT: Dedicated TX buffers are not used.
   */

  regval  = fdcan_getreg(priv, STM32_FDCAN_TXBC_OFFSET);
#ifdef CONFIG_STM32H7_FDCAN_QUEUE_MODE
  regval |= FDCAN_TXBC_TFQM;
#else
  regval &= ~FDCAN_TXBC_TFQM;
#endif
  fdcan_putreg(priv, STM32_FDCAN_TXBC_OFFSET, regval);

#ifdef STM32H7_FDCAN_LOOPBACK
  /* Is loopback mode selected for this peripheral? */

  if (config->loopback)
    {
     /* FDCAN_CCCR_TEST  - Test mode enable
      * FDCAN_CCCR_MON   - Bus monitoring mode (for internal loopback)
      * FDCAN_TEST_LBCK  - Loopback mode
      */

      regval = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
      regval |= (FDCAN_CCCR_TEST | FDCAN_CCCR_MON);
      fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);

      regval = fdcan_getreg(priv, STM32_FDCAN_TEST_OFFSET);
      regval |= FDCAN_TEST_LBCK;
      fdcan_putreg(priv, STM32_FDCAN_TEST_OFFSET, regval);
    }
#endif

  /* Configure interrupt lines */

  /* Select RX-related interrupts */

#if 0 /* Dedicated RX buffers are not used by this driver */
  priv->rxints = FDCAN_RXDEDBUF_INTS;
#else
  priv->rxints = FDCAN_RXFIFO_INTS;
#endif

  /* Select TX-related interrupts */

#if 0 /* Dedicated TX buffers are not used by this driver */
  priv->txints = FDCAN_TXDEDBUF_INTS;
#else
  priv->txints = FDCAN_TXFIFOQ_INTS;
#endif

  /* Direct all interrupts to Line 0.
   *
   * Bits in the ILS register correspond to each FDCAN interrupt; A bit
   * set to '1' is directed to interrupt line 1; a bit cleared to '0'
   * is directed interrupt line 0.
   *
   * REVISIT: Nothing is done here.  Only interrupt line 0 is used by
   * this driver and ILS was already cleared above.
   */

  /* Enable only interrupt line 0. */

  fdcan_putreg(priv, STM32_FDCAN_ILE_OFFSET, FDCAN_ILE_EINT0);

  /* Disable initialization mode to enable normal operation */

  regval  = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
  regval &= ~FDCAN_CCCR_INIT;
  fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_fdcan_initialize
 *
 * Description:
 *   Initialize the selected FDCAN port
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple FDCAN interfaces),
 *          0=FDCAN1, 1=FDCAN2
 *
 * Returned Value:
 *   Valid CAN device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

FAR struct can_dev_s *stm32_fdcan_initialize(int port)
{
  FAR struct can_dev_s *dev;
  FAR struct stm32_fdcan_s *priv;
  FAR const struct stm32_config_s *config;
  uint32_t regval;

  caninfo("FDCAN%d\n", port);

