apache/nuttx/arch/arm/src/stm32h7/stm32_fdcan_v2.c
  //TODO:
  // /* Select PCK5 clock source and pre-scaler value.  Both FDCAN controllers
  //  * use PCK5 to derive bit rate.
  //  */

  // regval = PMC_PCK_PRES(CONFIG_STM32H7_FDCAN_CLKSRC_PRESCALER - 1) |
  //          STM32H7_FDCAN_CLKSRC;
  // putreg32(regval, STM32_PMC_PCK5);

  // /* Enable PCK5 */

  // putreg32(PMC_PCK5, STM32_PMC_SCER);

  /* Select FDCAN peripheral to be initialized */

#ifdef CONFIG_STM32H7_FDCAN1
  if (port == FDCAN1)
    {
      /* Select the FDCAN1 device structure */

      dev    = &g_fdcan1dev;
      priv   = &g_fdcan1priv;
      config = &g_fdcan1const;

      /* Configure FDCAN1 Message RAM Base Address */
      
      //TODO: Check this out. Looks like a DMA mapping
      // regval  = getreg32(STM32_MATRIX_CAN0);
      // regval &= MATRIX_CAN0_RESERVED;
      // regval |= (uint32_t)config->msgram.stdfilters &
      //           MATRIX_CAN0_CAN0DMABA_MASK;
      // putreg32(regval, STM32_MATRIX_CAN0);
    }
  else
#endif
#ifdef CONFIG_STM32H7_FDCAN2
  if (port == FDCAN2)
    {
      /* Select the FDCAN2 device structure */

      dev    = &g_fdcan2dev;
      priv   = &g_fdcan2priv;
      config = &g_fdcan2const;

      /* Configure FDCAN2 Message RAM Base Address */

      //TODO: Check this out. Looks like a DMA mapping
      // regval  = getreg32(STM32_MATRIX_CCFG_SYSIO);
      // regval &= ~MATRIX_CCFG_CAN1DMABA_MASK;
      // regval |= (uint32_t)config->msgram.stdfilters &
      //           MATRIX_CCFG_CAN1DMABA_MASK;
      // putreg32(regval, STM32_MATRIX_CCFG_SYSIO);
    }
  else
#endif
    {
      canerr("ERROR: Unsupported port %d\n", port);
      return NULL;
    }

  /* Is this the first time that we have handed out this device? */

  if (priv->state == FDCAN_STATE_UNINIT)
    {
      /* Yes, then perform one time data initialization */

      memset(priv, 0, sizeof(struct stm32_fdcan_s));
      priv->config = config;

      /* Set the initial bit timing.  This might change subsequently
       * due to IOCTL command processing.
       */

      priv->nbtp   = config->nbtp;
      priv->dbtp   = config->dbtp;

      /* Initialize semaphores */

      nxsem_init(&priv->locksem, 0, 1);
      nxsem_init(&priv->txfsem, 0, config->ntxfifoq);

      dev->cd_ops  = &g_fdcanops;
      dev->cd_priv = (FAR void *)priv;

      /* And put the hardware in the initial state */

      fdcan_reset(dev);
    }

  return dev;
}

#endif /* CONFIG_CAN && CONFIG_STM32H7_FDCAN */
